<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.34 in css mode. -->
<html>
  <head>
    <title>mysql.org</title>
    <style type="text/css">
    <!--
      body {
        color: #F8F8F8;
        background-color: #0C1021;
      }
      .comment {
        /* font-lock-comment-face */
        color: #AEAEAE;
        font-style: italic;
      }
      .org-document-info {
        /* org-document-info */
        color: #afeeee;
      }
      .org-document-info-keyword {
        /* org-document-info-keyword */
        color: #b3b3b3;
      }
      .org-document-title {
        /* org-document-title */
        color: #afeeee;
        font-size: 144%;
        font-weight: bold;
      }
      .org-level-1 {
        /* org-level-1 */
        color: #FF6400;
      }
      .org-meta-line {
        /* org-meta-line */
        color: #AEAEAE;
        font-style: italic;
      }

      a {
        color: inherit;
        background-color: inherit;
        font: inherit;
        text-decoration: inherit;
      }
      a:hover {
        text-decoration: underline;
      }
    -->
    </style>
  </head>
  <body>
    <pre>
<span class="comment"># -*- coding:utf-8 -*-</span>
<span class="org-meta-line">#+LANGUAGE:  zh
</span><span class="org-document-info-keyword">#+TITLE:</span><span class="comment">     </span><span class="org-document-title">mysql&#25342; &#36951;</span>
<span class="org-document-info-keyword">#+AUTHOR:</span><span class="comment">    </span><span class="org-document-info">&#32426;&#31168;&#23792;</span>
<span class="org-document-info-keyword">#+EMAIL:</span><span class="comment">     </span><span class="org-document-info">jixiuf@gmail.com</span>
<span class="org-document-info-keyword">#+DATE:</span><span class="comment">     </span><span class="org-document-info">2012-04-22 &#26085;</span>
<span class="org-meta-line">#+DESCRIPTION:mysql.org
#+KEYWORDS:
#+OPTIONS:   H:2 num:nil toc:t \n:t @:t ::t |:t ^:nil -:t f:t *:t &lt;:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil
#+FILETAGS:
</span><span class="org-level-1">* MyISAM</span>
  MyISAM&#34920;&#22914;&#26524;&#22312;&#21019;&#24314;&#36873;&#39033;&#37324;&#25351;&#23450;&#20026;DELAY_KEY_WRITE&#30340;&#35805;&#65292;&#23427;&#19981;&#20250;&#31435;&#21363;&#23558;&#25913;&#21464;&#30340;&#32034;&#24341;&#25968;&#25454;&#20889;
  &#21040;&#30828;&#30424;&#65292;&#32780;&#26159;&#23558;&#36825;&#20010;&#25913;&#21464;&#32531;&#23384;&#21040;&#20869;&#23384;&#20013;&#12290;&#24403;&#34920;&#34987;&#20851;&#38381;&#25110;&#32773;&#32531;&#20914;&#21306;&#38656;&#35201;&#20462;&#25972;&#26102;&#65292;&#23427;&#20250;&#23558;&#32034;&#24341;
  &#19968;&#27425;&#24615;&#20889;&#21040;&#30828;&#30424;&#12290;&#36825;&#20010;&#29305;&#24615;&#21487;&#20197;&#22312;&#20462;&#25913;&#24456;&#39057;&#32321;&#30340;&#34920;&#19978;&#26497;&#22823;&#30340;&#25552;&#39640;&#24615;&#33021;&#12290;&#20294;&#26159;&#24403;&#19968;&#20010;&#26381;&#21153;&#22120;
  &#25110;&#32773;&#25805;&#20316;&#31995;&#32479;&#23849;&#28291;&#26102;&#65292;&#36825;&#20123;&#32034;&#24341;&#32943;&#23450;&#20250;&#34987;&#25439;&#22351;&#65292;&#24403;&#28982;&#20063;&#38656;&#35201;&#20462;&#22797;&#12290;&#20320;&#21487;&#36890;&#36807;&#20889;&#19968;&#20010;&#33050;&#26412;&#26469;
  &#22312;&#27599;&#27425;&#37325;&#21551;&#26381;&#21153;&#22120;&#21069;&#20808;&#29992;myisamchk&#26469;&#26816;&#26597;&#19968;&#19979;&#65292;&#25110;&#32773;&#20320;&#20063;&#21487;&#20197;&#20351;&#29992;&#33258;&#21160;&#20462;&#22797;&#36873;&#39033;&#12290;(&#21363;&#20351;
  &#20320;&#19981;&#20351;&#29992;DELAY_KEY_WRITE&#65292;&#36825;&#20123;&#23433;&#20840;&#24615;&#20445;&#38556;&#20063;&#26159;&#19968;&#20010;&#24456;&#22909;&#30340;&#20064;&#24815;&#12290;)&#20320;&#26082;&#21487;&#20197;&#23545;&#25972;&#20010;&#25968;&#25454;
  &#24211;&#35774;&#32622;&#24310;&#36831;&#30340;&#32034;&#24341;&#26356;&#26032;&#65292;&#20063;&#21487;&#20197;&#21482;&#38024;&#23545;&#26576;&#20123;&#34920;&#26469;&#36827;&#34892;&#35774;&#32622;&#12290;

<span class="org-level-1">* Archive</span>
  Archive&#24341;&#25806;&#21482;&#25903;&#25345;INSERT&#21644;SELECT&#35821;&#21477;&#65292;&#24182;&#19988;&#23427;&#19981;&#25903;&#25345;&#32034;&#24341;&#12290;&#23427;&#27604;MyISAM&#20351;&#29992;&#26356;&#23569;&#30340;&#30913;
  &#30424;IO&#65292;&#22240;&#27492;&#23427;&#20250;&#22312;&#20889;&#25805;&#20316;&#20043;&#21069;&#23558;&#25968;&#25454;&#32531;&#23384;&#24182;&#21033;&#29992;zlib&#26469;&#21387;&#32553;&#12290;&#32780;SELECT&#26597;&#35810;&#25805;&#20316;&#21017;&#38656;&#35201;&#19968;
  &#20010;&#20840;&#34920;&#25195;&#25551;&#12290;&#22240;&#27492;Archive&#34920;&#26159;&#26085;&#24535;&#21644;&#25968;&#25454;&#37319;&#38598;&#30340;&#29702;&#24819;&#36873;&#25321;&#65292;&#22312;&#36825;&#20123;&#24212;&#29992;&#20013;&#65292;&#19968;&#33324;&#20998;&#26512;&#26159;&#38656;
  &#35201;&#25195;&#25551;&#25972;&#24352;&#34920;&#25110;&#32773;&#38656;&#35201;&#22312;&#19968;&#20010;&#22791;&#20221;&#20027;&#26426;&#19978;&#36827;&#34892;&#24555;&#36895;&#30340;INSERT&#25805;&#20316;&#12290;&#22791;&#20221;&#20174;&#26426;&#19978;&#21487;&#20197;&#20026;&#30456;&#21516;
  &#30340;&#34920;&#36873;&#29992;&#19968;&#20010;&#19981;&#21516;&#30340;&#23384;&#20648;&#24341;&#25806;&#65292;&#36825;&#24847;&#21619;&#30528;&#20174;&#26426;&#19978;&#30340;&#34920;&#21487;&#20197;&#26377;&#32034;&#24341;&#65292;&#20197;&#36798;&#21040;&#24555;&#36895;&#20998;&#26512;&#30340;&#30446;&#30340;

  Archive&#24341;&#25806;&#25903;&#25345;&#34892;&#32423;&#21035;&#30340;&#38145;&#20197;&#21450;&#19968;&#20010;&#29305;&#27530;&#30340;&#32531;&#20914;&#31995;&#32479;&#20197;&#26399;&#36798;&#21040;&#39640;&#24182;&#21457;&#30340;&#20889;&#25805;&#20316;&#12290;&#23427;&#22312;&#26597;
  &#35810;&#26102;&#20250;&#23558;&#25972;&#20010;&#34920;&#25195;&#25551;&#19968;&#27425;&#12290;&#23427;&#21516;&#26102;&#20063;&#20250;&#23558;&#25209;&#37327;&#20889;&#25805;&#20316;&#23631;&#34109;&#30452;&#21040;&#20840;&#37096;&#30340;&#20889;&#25805;&#20316;&#23436;&#25104;&#12290;&#36825;&#20123;
  &#29305;&#24615;&#27169;&#25311;&#20102;&#20107;&#21153;&#21644;MVCC&#34892;&#20026;&#30340;&#19968;&#20123;&#26041;&#38754;&#65292;&#20294;&#26159;Archive&#24341;&#25806;&#24182;&#19981;&#26159;&#19968;&#20010;&#20107;&#21153;&#22411;&#24341;&#25806;&#12290;&#23427;&#21482;
  &#26159;&#19968;&#20010;&#20248;&#21270;&#20102;&#25554;&#20837;&#25805;&#20316;&#20197;&#21450;&#21387;&#32553;&#20102;&#25968;&#25454;&#30340;&#24341;&#25806;&#12290;


  &#24182;&#21457;&#24615;&#38656;&#27714;&#30340;&#26368;&#22909;&#30340;&#34913;&#37327;&#26631;&#20934;&#26159;&#20320;&#30340;&#24037;&#20316;&#37327;&#12290;&#22914;&#26524;&#20320;&#21482;&#37327;&#38656;&#35201;&#25554;&#20837;&#21644;&#20889;&#25805;&#20316;&#30340;&#24182;&#21457;&#24615;&#30340;
&#35805;&#65292;&#19981;&#31649;&#20320;&#30456;&#20449;&#19981;&#30456;&#20449;&#65292;MyISAM&#26159;&#19968;&#20010;&#24456;&#19981;&#38169;&#30340;&#36873;&#25321;&#12290;&#22914;&#26524;&#20320;&#38656;&#35201;&#35768;&#22810;&#25805;&#20316;&#28151;&#21512;&#25191;&#34892;&#32780;&#20114;
&#19981;&#24433;&#21709;&#30340;&#35805;&#65292;&#19968;&#20010;&#25903;&#25345;&#34892;&#38145;&#30340;&#24341;&#25806;&#23558;&#20250;&#26159;&#27604;&#36739;&#19981;&#38169;&#30340;&#36873;&#25321;&#12290;

  &#20551;&#22914;&#20320;&#24819;&#35201;&#29992;MysQL&#26469;&#23454;&#26102;&#35760;&#24405;&#20174;&#21628;&#21483;&#20013;&#24515;&#30340;&#30005;&#35805;&#26469;&#30340;&#27599;&#19968;&#20010;&#30005;&#35805;&#30340;&#26085;&#24535;&#35760;&#24405;&#12290;&#25110;&#32773;&#20320;&#21487;&#33021;
  &#24050;&#32463;&#20026;Apache&#23433;&#35013;&#20102;mod_log_sql&#27169;&#22359;&#65292;&#36825;&#26679;&#20320;&#23601;&#21487;&#20197;&#23558;&#32593;&#31449;&#25152;&#26377;&#30340;&#35775;&#38382;&#35760;&#24405;&#21040;&#25968;&#25454;&#24211;&#20013;&#12290;
  &#22312;&#36825;&#26679;&#30340;&#19968;&#20010;&#24212;&#29992;&#20013;&#65292;&#36895;&#24230;&#21487;&#33021;&#26159;&#26368;&#37325;&#35201;&#30340;&#30446;&#26631;&#65292;&#20320;&#19981;&#24819;&#35201;&#25968;&#25454;&#24211;&#25104;&#20026;&#29942;&#39048;&#12290;MyISAM&#21644;
  Archive&#23384;&#20648;&#24341;&#25806;&#23558;&#20250;&#26159;&#24456;&#22909;&#30340;&#36873;&#25321;&#65292;&#22240;&#20026;&#23427;&#20204;&#21482;&#26377;&#24456;&#20302;&#30340;&#24320;&#38144;&#24182;&#19988;&#21487;&#20197;&#19968;&#31186;&#38047;&#25554;&#20837;&#25104;&#21315;&#19978;
  &#19975;&#26465;&#35760;&#24405;&#12290;PBXT&#23384;&#20648;&#24341;&#25806;&#20063;&#21487;&#33021;&#29305;&#21035;&#36866;&#21512;&#36825;&#20010;&#30446;&#30340;&#12290;

  &#28982;&#32780;&#65292;&#22914;&#26524;&#20320;&#20915;&#23450;&#23545;&#24050;&#32463;&#35760;&#24405;&#30340;&#25968;&#25454;&#36827;&#34892;&#20998;&#26512;&#24635;&#32467;&#65292;&#37027;&#20040;&#20107;&#24773;&#23601;&#24320;&#22987;&#21464;&#24471;&#26377;&#36259;&#20102;&#12290;&#26681;&#25454;
  &#20320;&#25152;&#20351;&#29992;&#30340;&#26597;&#35810;&#30340;&#19981;&#21516;&#65292;&#26377;&#24456;&#22823;&#30340;&#21487;&#33021;&#24615;&#22240;&#20026;&#25968;&#25454;&#37319;&#38598;&#30340;&#24433;&#21709;&#32780;&#20351;&#24471;&#25972;&#20010;&#25554;&#20837;&#36807;&#31243;&#21464;&#24930;&#12290;
  &#36825;&#20010;&#26102;&#20505;&#20320;&#24212;&#35813;&#24590;&#20040;&#21150;&#65311;

  &#35299;&#20915;&#26041;&#26696;&#26159;&#21033;&#29992;MySQL&#30340;&#20869;&#32622;&#22797;&#21046;&#29305;&#24615;&#26469;&#23558;&#25968;&#25454;&#20811;&#38534;&#21040;&#31532;&#20108;&#21488;&#26381;&#21153;&#22120;&#65288;&#20174;&#26426;&#65289;&#19978;&#65292;&#28982;&#21518;&#22312;&#20174;
  &#26426;&#19978;&#36816;&#34892;&#23545;&#20110;&#23545;&#20110;&#26102;&#38388;&#21644;CPU&#35201;&#27714;&#27604;&#36739;&#39640;&#30340;&#26597;&#35810;&#12290;&#36825;&#20351;&#24471;&#20027;&#26426;&#21482;&#26159;&#25554;&#20837;&#25805;&#20316;&#65292;&#24182;&#19988;&#21487;&#20197;&#20351;
  &#20320;&#22312;&#20174;&#26426;&#19978;&#36816;&#34892;&#20219;&#20309;&#20320;&#38656;&#35201;&#30340;&#26597;&#35810;&#32780;&#19981;&#24517;&#25285;&#24515;&#23545;&#26085;&#24535;&#23454;&#26102;&#24615;&#30340;&#24433;&#21709;

  &#20320;&#20063;&#21487;&#20197;&#23558;&#26597;&#35810;&#20998;&#25104;&#24320;&#38144;&#24456;&#23567;&#30340;&#26597;&#35810;&#26469;&#23436;&#25104;&#20219;&#21153;&#65292;&#20294;&#26159;&#19981;&#35201;&#25351;&#26395;&#36825;&#20010;&#31574;&#30053;&#33021;&#19968;&#30452;&#26377;&#25928;&#65292;
  &#22240;&#20026;&#20320;&#30340;&#31243;&#24207;&#30340;&#35268;&#27169;&#19968;&#30452;&#22312;&#22686;&#38271;&#12290;

  &#21478;&#22806;&#30340;&#19968;&#20010;&#36873;&#25321;&#26159;&#20351;&#29992;Merge&#34920;&#12290;Merge&#34920;&#19981;&#20250;&#24635;&#26159;&#23558;&#26085;&#24535;&#35760;&#24405;&#21040;&#21516;&#19968;&#20010;&#34920;&#65292;&#21487;&#20197;&#36890;&#36807;&#35843;
&#25972;&#24212;&#29992;&#20351;&#24471;&#26085;&#24535;&#25353;&#29031;&#38656;&#27714;&#35760;&#24405;&#21040;&#25353;&#24180;&#12289;&#26376;&#12289;&#26085;&#20998;&#34920;&#30340;&#34920;&#20013;&#21435;&#65292;&#27604;&#22914;web_log_2009_01&#25110;&#32773;
web_log_2009_01_01&#12290;&#28982;&#21518;&#23450;&#20041;&#19968;&#20010;Merge&#34920;&#65292;&#23427;&#21253;&#21547;&#20102;&#20320;&#24819;&#35201;&#36827;&#34892;&#32508;&#21512;&#20998;&#26512;&#30340;&#25968;&#25454;&#12290;&#22914;&#26524;
&#20320;&#38656;&#35201;&#20998;&#26512;&#19968;&#22825;&#25110;&#32773;&#19968;&#21608;&#30340;&#25968;&#25454;&#65292;&#37027;&#20040;&#36825;&#20010;&#31574;&#30053;&#21487;&#20197;&#30452;&#25509;&#20351;&#29992;&#65292;&#32780;&#20320;&#21482;&#38656;&#35201;&#21019;&#24314;&#20998;&#24471;&#26356;&#32454;
&#30340;&#34920;&#65292;&#27604;&#22914;web_logs_2008_01_01&#12290;&#20320;&#30340;&#24212;&#29992;&#23558;&#26085;&#24535;&#25554;&#20837;&#21040;&#19968;&#24352;&#34920;&#20013;&#65292;&#32780;&#20320;&#32780;&#22312;&#20854;&#20182;&#30340;&#34920;&#19978;
&#36827;&#34892;&#26597;&#35810;&#12290;
</pre>
  </body>
</html>
