<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.34 in css mode. -->
<html>
  <head>
    <title>ext2.org</title>
    <style type="text/css">
    <!--
      body {
        color: #F8F8F8;
        background-color: #0C1021;
      }
      .comment {
        /* font-lock-comment-face */
        color: #AEAEAE;
        font-style: italic;
      }
      .italic {
        /* italic */
        font-style: italic;
      }
      .org-block {
        /* org-block */
        color: #b3b3b3;
      }
      .org-block-begin-line {
        /* org-block-begin-line */
        color: #AEAEAE;
        font-style: italic;
      }
      .org-block-end-line {
        /* org-block-end-line */
        color: #AEAEAE;
        font-style: italic;
      }
      .org-document-info {
        /* org-document-info */
        color: #afeeee;
      }
      .org-document-info-keyword {
        /* org-document-info-keyword */
        color: #b3b3b3;
      }
      .org-document-title {
        /* org-document-title */
        color: #afeeee;
        font-size: 144%;
        font-weight: bold;
      }
      .org-level-1 {
        /* org-level-1 */
        color: #FF6400;
      }
      .org-level-2 {
        /* org-level-2 */
        color: #40E0D0;
      }
      .org-link {
        /* org-link */
        color: #00ffff;
        text-decoration: underline;
      }
      .org-meta-line {
        /* org-meta-line */
        color: #AEAEAE;
        font-style: italic;
      }

      a {
        color: inherit;
        background-color: inherit;
        font: inherit;
        text-decoration: inherit;
      }
      a:hover {
        text-decoration: underline;
      }
    -->
    </style>
  </head>
  <body>
    <pre>
<span class="comment"># -*- coding:utf-8 -*-</span>
<span class="org-meta-line">#+LANGUAGE:  zh
</span><span class="org-document-info-keyword">#+TITLE:</span><span class="comment">     </span><span class="org-document-title">ext2&#25991;&#20214;&#31995;&#32479;</span>
<span class="org-document-info-keyword">#+AUTHOR:</span><span class="comment">    </span><span class="org-document-info">&#32426;&#31168;&#23792;</span>
<span class="org-document-info-keyword">#+EMAIL:</span><span class="comment">     </span><span class="org-document-info">jixiuf@gmail.com</span>
<span class="org-document-info-keyword">#+DATE:</span><span class="comment">     </span><span class="org-document-info">2012-05-01 &#20108;</span>
<span class="org-meta-line">#+DESCRIPTION:ext2&#25991;&#20214;&#31995;&#32479;
#+KEYWORDS:
#+OPTIONS:   H:2 num:nil toc:t \n:t @:t ::t |:t ^:t -:t f:t *:t &lt;:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil
#+FILETAGS: @Linux @C
</span><span class="org-level-1">* &#38142;&#25509;</span>
  <span class="org-link">http://learn.akae.cn/media/ch29s02.html</span>
<span class="org-level-1">* ext2</span>
  <span class="org-link">file:../download/ext2.png</span>

  &#25991;&#20214;&#31995;&#32479;&#20013;&#23384;&#20648;&#30340;&#26368;&#23567;&#21333;&#20301;&#26159;&#22359;&#65288;Block&#65289;&#65292;&#19968;&#20010;&#22359;&#31350;&#31455;&#22810;&#22823;&#26159;&#22312;&#26684;&#24335;&#21270;&#26102;&#30830;&#23450;&#30340;&#65292;&#20363;&#22914;
  mke2fs&#30340;-b&#36873;&#39033;&#21487;&#20197;&#35774;&#23450;&#22359;&#22823;&#23567;&#20026;1024&#12289;2048&#25110;4096&#23383;&#33410;,&#40664;&#35748;&#26159;1024byte&#12290;
  &#19968;&#20010;&#20998;&#21306;&#30340;&#24320;&#22836;&#24517;&#39035;&#26377;1k&#30340;boot block&#65292;&#36825;1k&#26159;PC&#26631;&#20934;&#35268;&#23450;&#30340;&#65292;&#20219;&#20309;&#25991;&#20214;&#31995;&#32479;&#19981;&#33021;&#20351;&#29992;&#36825;
  &#22359;&#20869;&#23481;,&#21551;&#21160;&#22359;&#20043;&#21518;&#25165;&#26159;&#25991;&#20214;&#31995;&#32479;&#12290;
  ext2&#25991;&#20214;&#31995;&#32479;&#23558;&#25972;&#20010;&#20998;&#21306;&#21010;&#25104;&#33509;&#24178;&#20010;&#21516;&#26679;&#22823;&#23567;&#30340;&#22359;&#32452;&#65288;Block Group&#65289;
<span class="org-level-2">** &#36229;&#32423;&#22359;&#65288;Super Block&#65289;</span>
   &#25551;&#36848; <span class="italic">/&#25972;&#20010;&#20998;&#21306;/</span> &#30340;&#25991;&#20214;&#31995;&#32479;&#20449;&#24687;&#65292;&#20363;&#22914;&#22359;&#22823;&#23567;&#12289;&#25991;&#20214;&#31995;&#32479;&#29256;&#26412;&#21495;&#12289;&#19978;&#27425;mount&#30340;&#26102;&#38388;&#31561;
   &#31561;&#12290;&#36229;&#32423;&#22359;&#22312;&#27599;&#20010;&#22359;&#32452;&#30340;&#24320;&#22836;&#37117;&#26377;&#19968;&#20221;&#25335;&#36125;&#12290;(&#21344;&#29992;&#19968;&#20010;block&#22359;&#22823;&#23567;).
   &#30001;&#20110;super block&#24456;&#37325;&#35201; &#65292;&#22312;&#27599;&#20010; block group&#37117;&#20250;&#23384;&#19968;&#20221;&#36827;&#34892;&#22791;&#20221;.

<span class="org-level-2">** &#22359;&#32452;&#25551;&#36848;&#31526;&#34920;&#65288;GDT&#65292;Group Descriptor Table&#65289;</span>
   &#30001;&#24456;&#22810;&#22359;&#32452;&#25551;&#36848;&#31526;&#32452;&#25104;&#65292;&#25972;&#20010;&#20998;&#21306;&#20998;&#25104;&#22810;&#23569;&#20010;&#22359;&#32452;&#23601;&#23545;&#24212;&#26377;&#22810;&#23569;&#20010;&#22359;&#32452;&#25551;&#36848;&#31526;&#12290;&#27599;&#20010;
   &#22359;&#32452;&#25551;&#36848;&#31526;&#65288;Group Descriptor&#65289;&#23384;&#20648;&#19968;&#20010;&#22359;&#32452;&#30340;&#25551;&#36848;&#20449;&#24687;&#65292;&#20363;&#22914;&#22312;&#36825;&#20010;&#22359;&#32452;&#20013;&#20174;&#21738;
   &#37324;&#24320;&#22987;&#26159;inode&#34920;&#65292;&#20174;&#21738;&#37324;&#24320;&#22987;&#26159;&#25968;&#25454;&#22359;&#65292;&#31354;&#38386;&#30340;inode&#21644;&#25968;&#25454;&#22359;&#36824;&#26377;&#22810;&#23569;&#20010;&#31561;&#31561;&#12290;&#21644;
   &#36229;&#32423;&#22359;&#31867;&#20284;&#65292;&#22359;&#32452;&#25551;&#36848;&#31526;&#34920;&#22312;&#27599;&#20010;&#22359;&#32452;&#30340;&#24320;&#22836;&#20063;&#37117;&#26377;&#19968;&#20221;&#25335;&#36125;_&#65292;&#36825;&#20123;&#20449;&#24687;&#26159;&#38750;&#24120;&#37325;&#35201;
   &#30340;&#65292;&#19968;&#26086;&#36229;&#32423;&#22359;&#24847;&#22806;&#25439;&#22351;&#23601;&#20250;&#20002;&#22833;&#25972;&#20010;&#20998;&#21306;&#30340;&#25968;&#25454;&#65292;&#19968;&#26086;&#22359;&#32452;&#25551;&#36848;&#31526;&#24847;&#22806;&#25439;&#22351;&#23601;&#20250;&#20002;
   &#22833;&#25972;&#20010;&#22359;&#32452;&#30340;&#25968;&#25454;&#65292;&#22240;&#27492;&#23427;&#20204;&#37117;&#26377;&#22810;&#20221;&#25335;&#36125;&#12290;/&#36890;&#24120;&#20869;&#26680;&#21482;&#29992;&#21040;&#31532;0&#20010;&#22359;&#32452;&#20013;&#30340;&#25335;&#36125;/&#65292;&#24403;
   &#25191;&#34892;e2fsck&#26816;&#26597;&#25991;&#20214;&#31995;&#32479;&#19968;&#33268;&#24615;&#26102;&#65292;&#31532;0&#20010;&#22359;&#32452;&#20013;&#30340;&#36229;&#32423;&#22359;&#21644;&#22359;&#32452;&#25551;&#36848;&#31526;&#34920;&#23601;&#20250;&#25335;&#36125;&#21040;
   &#20854;&#23427;&#22359;&#32452;&#65292;&#36825;&#26679;&#24403;&#31532;0&#20010;&#22359;&#32452;&#30340;&#24320;&#22836;&#24847;&#22806;&#25439;&#22351;&#26102;&#23601;&#21487;&#20197;&#29992;&#20854;&#23427;&#25335;&#36125;&#26469;&#24674;&#22797;&#65292;&#20174;&#32780;&#20943;&#23569;&#25439;
   &#22833;&#12290;
<span class="org-level-2">** &#22359;&#20301;&#22270;&#65288;Block Bitmap&#65289;</span>
   &#19968;&#20010;&#22359;&#32452;&#20013;&#30340;&#22359;&#26159;&#36825;&#26679;&#21033;&#29992;&#30340;&#65306;&#25968;&#25454;&#22359;&#23384;&#20648;&#25152;&#26377;&#25991;&#20214;&#30340;&#25968;&#25454;&#65292;&#27604;&#22914;&#26576;&#20010;&#20998;&#21306;&#30340;&#22359;&#22823;&#23567;
   &#26159;1024&#23383;&#33410;&#65292;&#26576;&#20010;&#25991;&#20214;&#26159;2049&#23383;&#33410;&#65292;&#37027;&#20040;&#23601;&#38656;&#35201;&#19977;&#20010;&#25968;&#25454;&#22359;&#26469;&#23384;&#65292;&#21363;&#20351;&#31532;&#19977;&#20010;&#22359;&#21482;&#23384;
   &#20102;&#19968;&#20010;&#23383;&#33410;&#20063;&#38656;&#35201;&#21344;&#29992;&#19968;&#20010;&#25972;&#22359;&#65307;&#36229;&#32423;&#22359;&#12289;&#22359;&#32452;&#25551;&#36848;&#31526;&#34920;&#12289;&#22359;&#20301;&#22270;&#12289;inode&#20301;&#22270;&#12289;
   inode&#34920;&#36825;&#20960;&#37096;&#20998;&#23384;&#20648;&#35813;&#22359;&#32452;&#30340;&#25551;&#36848;&#20449;&#24687;&#12290;&#37027;&#20040;&#22914;&#20309;&#30693;&#36947;&#21738;&#20123;&#22359;&#24050;&#32463;&#29992;&#26469;&#23384;&#20648;&#25991;&#20214;&#25968;&#25454;
   &#25110;&#20854;&#23427;&#25551;&#36848;&#20449;&#24687;&#65292;&#21738;&#20123;&#22359;&#20173;&#28982;&#31354;&#38386;&#21487;&#29992;&#21602;&#65311;&#22359;&#20301;&#22270;&#23601;&#26159;&#29992;&#26469;&#25551;&#36848;&#25972;&#20010;&#22359;&#32452;&#20013;&#21738;&#20123;&#22359;&#24050;
   &#29992;&#21738;&#20123;&#22359;&#31354;&#38386;&#30340;&#65292;&#23427;&#26412;&#36523;&#21344;&#19968;&#20010;&#22359;&#65292;&#20854;&#20013;&#30340;&#27599;&#20010;bit&#20195;&#34920;&#26412;&#22359;&#32452;&#20013;&#30340;&#19968;&#20010;&#22359;&#65292;&#36825;&#20010;bit
   &#20026;1&#34920;&#31034;&#35813;&#22359;&#24050;&#29992;&#65292;&#36825;&#20010;bit&#20026;0&#34920;&#31034;&#35813;&#22359;&#31354;&#38386;&#21487;&#29992;&#12290;
   &#20026;&#20160;&#20040;&#29992;df&#21629;&#20196;&#32479;&#35745;&#25972;&#20010;&#30913;&#30424;&#30340;&#24050;&#29992;&#31354;&#38388;&#38750;&#24120;&#24555;&#21602;&#65311;&#22240;&#20026;&#21482;&#38656;&#35201;&#26597;&#30475;&#27599;&#20010;&#22359;&#32452;&#30340;&#22359;&#20301;
   &#22270;&#21363;&#21487;&#65292;&#32780;&#19981;&#38656;&#35201;&#25628;&#36941;&#25972;&#20010;&#20998;&#21306;&#12290;&#30456;&#21453;&#65292;&#29992;du&#21629;&#20196;&#26597;&#30475;&#19968;&#20010;&#36739;&#22823;&#30446;&#24405;&#30340;&#24050;&#29992;&#31354;&#38388;&#23601;&#38750;
   &#24120;&#24930;&#65292;&#22240;&#20026;&#19981;&#21487;&#36991;&#20813;&#22320;&#35201;&#25628;&#36941;&#25972;&#20010;&#30446;&#24405;&#30340;&#25152;&#26377;&#25991;&#20214;&#12290;
   &#19982;&#27492;&#30456;&#32852;&#31995;&#30340;&#21478;&#19968;&#20010;&#38382;&#39064;&#26159;&#65306;&#22312;&#26684;&#24335;&#21270;&#19968;&#20010;&#20998;&#21306;&#26102;&#31350;&#31455;&#20250;&#21010;&#20986;&#22810;&#23569;&#20010;&#22359;&#32452;&#21602;&#65311;&#20027;&#35201;&#30340;
   &#38480;&#21046;&#22312;&#20110;&#22359;&#20301;&#22270;&#26412;&#36523;&#24517;&#39035;&#21482;&#21344;&#19968;&#20010;&#22359;&#12290;&#29992;mke2fs&#26684;&#24335;&#21270;&#26102;&#40664;&#35748;&#22359;&#22823;&#23567;&#26159;1024&#23383;&#33410;&#65292;&#21487;
   &#20197;&#29992;-b&#21442;&#25968;&#25351;&#23450;&#22359;&#22823;&#23567;&#65292;&#29616;&#22312;&#35774;&#22359;&#22823;&#23567;&#25351;&#23450;&#20026;b&#23383;&#33410;&#65292;&#37027;&#20040;&#19968;&#20010;&#22359;&#21487;&#20197;&#26377;8b&#20010;bit&#65292;&#36825;
   &#26679;&#22823;&#23567;&#30340;&#19968;&#20010;&#22359;&#20301;&#22270;&#23601;&#21487;&#20197;&#34920;&#31034;8b&#20010;&#22359;&#30340;&#21344;&#29992;&#24773;&#20917;&#65292;&#22240;&#27492;&#19968;&#20010;&#22359;&#32452;&#26368;&#22810;&#21487;&#20197;&#26377;8b&#20010;&#22359;&#65292;
   &#22914;&#26524;&#25972;&#20010;&#20998;&#21306;&#26377;s&#20010;&#22359;&#65292;&#37027;&#20040;&#23601;&#21487;&#20197;&#26377;s/(8b)&#20010;&#22359;&#32452;&#12290;&#26684;&#24335;&#21270;&#26102;&#21487;&#20197;&#29992;-g&#21442;&#25968;&#25351;&#23450;&#19968;&#20010;
   &#22359;&#32452;&#26377;&#22810;&#23569;&#20010;&#22359;&#65292;&#20294;&#26159;&#36890;&#24120;&#19981;&#38656;&#35201;&#25163;&#21160;&#25351;&#23450;&#65292;mke2fs&#24037;&#20855;&#20250;&#35745;&#31639;&#20986;&#26368;&#20248;&#30340;&#25968;&#20540;&#12290;

<span class="org-level-2">** inode&#20301;&#22270;&#65288;inode Bitmap&#65289;</span>
   &#21644;&#22359;&#20301;&#22270;&#31867;&#20284;&#65292;&#26412;&#36523;&#21344;&#19968;&#20010;&#22359;&#65292;&#20854;&#20013;&#27599;&#20010;bit&#34920;&#31034;&#19968;&#20010;inode&#26159;&#21542;&#31354;&#38386;&#21487;&#29992;&#12290;
<span class="org-level-2">** inode&#34920;&#65288;inode Table&#65289;</span>
   &#25105;&#20204;&#30693;&#36947;&#65292;&#19968;&#20010;&#25991;&#20214;&#38500;&#20102;&#25968;&#25454;&#38656;&#35201;&#23384;&#20648;&#20043;&#22806;&#65292;&#19968;&#20123;&#25551;&#36848;&#20449;&#24687;&#20063;&#38656;&#35201;&#23384;&#20648;&#65292;&#20363;&#22914;&#25991;&#20214;&#31867;
   &#22411;&#65288;&#24120;&#35268;&#12289;&#30446;&#24405;&#12289;&#31526;&#21495;&#38142;&#25509;&#31561;&#65289;&#65292;&#26435;&#38480;&#65292;&#25991;&#20214;&#22823;&#23567;&#65292;&#21019;&#24314;/&#20462;&#25913;/&#35775;&#38382;&#26102;&#38388;&#31561;&#65292;&#20063;&#23601;&#26159;
   ls -l&#21629;&#20196;&#30475;&#21040;&#30340;&#37027;&#20123;&#20449;&#24687;&#65292;&#36825;&#20123;&#20449;&#24687;&#23384;&#22312;inode&#20013;&#32780;&#19981;&#26159;&#25968;&#25454;&#22359;&#20013;&#12290;&#27599;&#20010;&#25991;&#20214;&#37117;&#26377;&#19968;
   &#20010;inode&#65292;&#19968;&#20010;&#22359;&#32452;&#20013;&#30340;&#25152;&#26377;inode&#32452;&#25104;&#20102;inode&#34920;&#12290;
   <span class="org-link">file:../download/fs.rootinode.png</span>

   inode&#34920;&#21344;&#22810;&#23569;&#20010;&#22359;&#22312;&#26684;&#24335;&#21270;&#26102;&#23601;&#35201;&#20915;&#23450;&#24182;&#20889;&#20837;&#22359;&#32452;&#25551;&#36848;&#31526;&#20013;&#65292;mke2fs&#26684;&#24335;&#21270;&#24037;&#20855;&#30340;&#40664;&#35748;&#31574;
   &#30053;&#26159;&#19968;&#20010;&#22359;&#32452;&#26377;&#22810;&#23569;&#20010;8KB&#23601;&#20998;&#37197;&#22810;&#23569;&#20010;inode&#12290;&#30001;&#20110;&#25968;&#25454;&#22359;&#21344;&#20102;&#25972;&#20010;&#22359;&#32452;&#30340;&#32477;&#22823;&#37096;&#20998;&#65292;&#20063;
   &#21487;&#20197;&#36817;&#20284;&#35748;&#20026;&#25968;&#25454;&#22359;&#26377;&#22810;&#23569;&#20010;8KB&#23601;&#20998;&#37197;&#22810;&#23569;&#20010;inode&#65292;&#25442;&#21477;&#35805;&#35828;&#65292;&#22914;&#26524;&#24179;&#22343;&#27599;&#20010;&#25991;&#20214;&#30340;&#22823;
   &#23567;&#26159;8KB&#65292;&#24403;&#20998;&#21306;&#23384;&#28385;&#30340;&#26102;&#20505;inode&#34920;&#20250;&#24471;&#21040;&#27604;&#36739;&#20805;&#20998;&#30340;&#21033;&#29992;&#65292;&#25968;&#25454;&#22359;&#20063;&#19981;&#28010;&#36153;&#12290;&#22914;&#26524;&#36825;&#20010;
   &#20998;&#21306;&#23384;&#30340;&#37117;&#26159;&#24456;&#22823;&#30340;&#25991;&#20214;&#65288;&#27604;&#22914;&#30005;&#24433;&#65289;&#65292;&#21017;&#25968;&#25454;&#22359;&#29992;&#23436;&#30340;&#26102;&#20505;inode&#20250;&#26377;&#19968;&#20123;&#28010;&#36153;&#65292;&#22914;&#26524;&#36825;
   &#20010;&#20998;&#21306;&#23384;&#30340;&#37117;&#26159;&#24456;&#23567;&#30340;&#25991;&#20214;&#65288;&#27604;&#22914;&#28304;&#20195;&#30721;&#65289;&#65292;&#21017;&#26377;&#21487;&#33021;&#25968;&#25454;&#22359;&#36824;&#27809;&#29992;&#23436;inode&#23601;&#24050;&#32463;&#29992;&#23436;&#20102;&#65292;
   &#25968;&#25454;&#22359;&#21487;&#33021;&#26377;&#24456;&#22823;&#30340;&#28010;&#36153;&#12290;&#22914;&#26524;&#29992;&#25143;&#22312;&#26684;&#24335;&#21270;&#26102;&#33021;&#22815;&#23545;&#36825;&#20010;&#20998;&#21306;&#20197;&#21518;&#35201;&#23384;&#20648;&#30340;&#25991;&#20214;&#22823;&#23567;&#20570;
   &#19968;&#20010;&#39044;&#27979;&#65292;&#20063;&#21487;&#20197;&#29992;mke2fs&#30340;-i&#21442;&#25968;&#25163;&#21160;&#25351;&#23450;&#27599;&#22810;&#23569;&#20010;&#23383;&#33410;&#20998;&#37197;&#19968;&#20010;inode&#12290;

<span class="org-level-2">** &#25968;&#25454;&#22359;&#65288;Data Block&#65289;</span>

   &#26681;&#25454;&#19981;&#21516;&#30340;&#25991;&#20214;&#31867;&#22411;&#26377;&#20197;&#19979;&#20960;&#31181;&#24773;&#20917;
        + &#23545;&#20110;&#24120;&#35268;&#25991;&#20214;&#65292;&#25991;&#20214;&#30340;&#25968;&#25454;&#23384;&#20648;&#22312;&#25968;&#25454;&#22359;&#20013;&#12290;
        + &#23545;&#20110;&#30446;&#24405;&#65292;&#35813;&#30446;&#24405;&#19979;&#30340;&#25152;&#26377;&#25991;&#20214;&#21517;&#21644;&#30446;&#24405;&#21517;&#23384;&#20648;&#22312;&#25968;&#25454;&#22359;&#20013;&#65292;&#27880;&#24847;&#25991;&#20214;&#21517;&#20445;&#23384;
          &#22312;&#23427;&#25152;&#22312;&#30446;&#24405;&#30340;&#25968;&#25454;&#22359;&#20013;&#65292;&#38500;&#25991;&#20214;&#21517;&#20043;&#22806;&#65292;ls -l&#21629;&#20196;&#30475;&#21040;&#30340;&#20854;&#23427;&#20449;&#24687;&#37117;&#20445;&#23384;&#22312;
          &#35813;&#25991;&#20214;&#30340;inode&#20013;&#12290;&#27880;&#24847;&#36825;&#20010;&#27010;&#24565;&#65306;&#30446;&#24405;&#20063;&#26159;&#19968;&#31181;&#25991;&#20214;&#65292;&#26159;&#19968;&#31181;&#29305;&#27530;&#31867;&#22411;&#30340;&#25991;&#20214;&#12290;
        + &#23545;&#20110;&#31526;&#21495;&#38142;&#25509;&#65292;&#22914;&#26524;&#30446;&#26631;&#36335;&#24452;&#21517;&#36739;&#30701;&#21017;&#30452;&#25509;&#20445;&#23384;&#22312;inode&#20013;&#20197;&#20415;&#26356;&#24555;&#22320;&#26597;&#25214;&#65292;&#22914;
          &#26524;&#30446;&#26631;&#36335;&#24452;&#21517;&#36739;&#38271;&#21017;&#20998;&#37197;&#19968;&#20010;&#25968;&#25454;&#22359;&#26469;&#20445;&#23384;&#12290;
        + &#35774;&#22791;&#25991;&#20214;&#12289;FIFO&#21644;socket&#31561;&#29305;&#27530;&#25991;&#20214;&#27809;&#26377;&#25968;&#25454;&#22359;&#65292;&#35774;&#22791;&#25991;&#20214;&#30340;&#20027;&#35774;&#22791;&#21495;&#21644;&#27425;&#35774;
          &#22791;&#21495;&#20445;&#23384;&#22312;inode&#20013;
   &#40664;&#35748;&#30340;&#22359;&#22823;&#23567;&#26159;4k.

<span class="org-block-begin-line">   #+BEGIN_SRC sh
</span><span class="org-block">      dd if=/dev/zero of=fs count=256 bs=4K
      mke2fs fs
</span><span class="org-block-end-line">   #+END_SRC
</span>   &#22359;&#22823;&#23567;&#26159;1024&#23383;&#33410;&#65292;1MB&#30340;&#20998;&#21306;&#20849;&#26377;1024&#20010;&#22359;&#65292;&#31532;0&#20010;&#22359;&#26159;&#21551;&#21160;&#22359;&#65292;&#21551;&#21160;&#22359;&#20043;&#21518;&#25165;&#31639;ext2&#25991;
   &#20214;&#31995;&#32479;&#30340;&#24320;&#22987;&#65292;&#22240;&#27492;Group 0&#21344;&#25454;&#31532;1&#20010;&#21040;&#31532;1023&#20010;&#22359;&#65292;&#20849;1023&#20010;&#22359;&#12290;&#22359;&#20301;&#22270;&#21344;&#19968;&#20010;&#22359;&#65292;&#20849;
   &#26377;1024&#215;8=8192&#20010;bit&#65292;&#36275;&#22815;&#34920;&#31034;&#36825;1023&#20010;&#22359;&#20102;&#65292;&#22240;&#27492;&#21482;&#35201;&#19968;&#20010;&#22359;&#32452;&#23601;&#22815;&#20102;&#12290;&#40664;&#35748;&#26159;&#27599;8KB
   &#20998;&#37197;&#19968;&#20010;inode&#65292;&#22240;&#27492;1MB&#30340;&#20998;&#21306;&#23545;&#24212;128&#20010;inode&#65292;&#36825;&#20123;&#25968;&#25454;&#37117;&#21644;dumpe2fs&#30340;&#36755;&#20986;&#21563;&#21512;&#12290;



   &#20174;000000&#24320;&#22987;&#30340;1KB&#26159;&#21551;&#21160;&#22359;&#65292;&#30001;&#20110;&#36825;&#19981;&#26159;&#19968;&#20010;&#30495;&#27491;&#30340;&#30913;&#30424;&#20998;&#21306;&#65292;&#21551;&#21160;&#22359;&#30340;&#20869;&#23481;&#20840;&#37096;&#20026;
   &#38646;&#12290;&#20174;000400&#21040;0007ff&#30340;1KB&#26159;&#36229;&#32423;&#22359;&#65292;&#23545;&#29031;&#30528;dumpe2fs&#30340;&#36755;&#20986;&#20449;&#24687;&#65292;&#35814;&#32454;&#20998;&#26512;&#22914;&#19979;&#65306;
   <span class="org-link">file:../download/fs.sb.png</span>

   &#20174;000800&#24320;&#22987;&#26159;&#22359;&#32452;&#25551;&#36848;&#31526;&#34920;&#65292;&#36825;&#20010;&#25991;&#20214;&#31995;&#32479;&#36739;&#23567;&#65292;&#21482;&#26377;&#19968;&#20010;&#22359;&#32452;&#25551;&#36848;&#31526;&#65292;&#23545;&#29031;&#30528;
   dumpe2fs&#30340;&#36755;&#20986;&#20449;&#24687;&#20998;&#26512;&#22914;&#19979;&#65306;
   <span class="org-link">file:../download/fs.gd.png</span>
<span class="org-block-begin-line">   #+BEGIN_SRC sh
</span><span class="org-block">   dumpe2fs /dev/vg1/portage
   dumpe2fs /tmp/fs
</span><span class="org-block-end-line">   #+END_SRC
</span><span class="org-block-begin-line">   #+BEGIN_QUOTE
</span>   Group 0: (Blocks 1-1023)
   Primary superblock at 1, Group descriptors at 2-2
   Reserved GDT blocks at 3-5
   Block bitmap at 6 (+5), Inode bitmap at 7 (+6)
   Inode table at 8-23 (+7)
   986 free blocks, 117 free inodes, 2 directories
   Free blocks: 38-1023
   Free inodes: 12-128<span class="org-meta-line">
</span><span class="org-block-end-line">   #+END_QUOTE
</span>   jkk&#22359;&#32452;&#25551;&#36848;&#31526;&#25351;&#20986;&#65292;&#31354;&#38386;&#30340;inode&#26377;117&#20010;&#65292;&#30001;&#20110;&#25991;&#20214;&#31995;&#32479;&#26159;&#26032;&#21019;&#24314;&#30340;&#65292;&#31354;&#38386;&#30340;inode&#20063;&#26159;
   &#36830;&#32493;&#30340;&#65292;inode&#32534;&#21495;&#20174;1&#21040;128&#65292;&#31354;&#38386;&#30340;inode&#32534;&#21495;&#20174;12&#21040;128&#12290;&#20174;inode&#20301;&#22270;&#21487;&#20197;&#30475;&#20986;&#65292;&#21069;
   11&#20301;&#37117;&#26159;1&#65292;&#34920;&#31034;&#21069;11&#20010;inode&#24050;&#29992;
   001c00&#36825;&#19968;&#34892;&#30340;128&#20301;&#23601;&#34920;&#31034;&#20102;&#25152;&#26377;inode&#65292;&#22240;&#27492;&#19979;&#38754;&#30340;&#34892;&#19981;&#31649;&#26159;0&#36824;&#26159;1&#37117;&#27809;&#26377;&#24847;&#20041;&#12290;&#24050;
   &#29992;&#30340;11&#20010;inode&#20013;&#65292;&#21069;10&#20010;inode&#26159;&#34987;ext2&#25991;&#20214;&#31995;&#32479;&#20445;&#30041;&#30340;&#65292;&#20854;&#20013;&#31532;2&#20010;inode&#26159;&#26681;&#30446;&#24405;&#65292;
   &#31532;11&#20010;inode&#26159;lost+found&#30446;&#24405;&#65292;&#22359;&#32452;&#25551;&#36848;&#31526;&#20063;&#25351;&#20986;&#35813;&#32452;&#26377;&#20004;&#20010;&#30446;&#24405;&#65292;&#23601;&#26159;&#26681;&#30446;&#24405;&#21644;
   lost+found&#12290;

   &#25972;&#20010;&#25991;&#20214;&#31995;&#32479;&#26159;1MB&#65292;&#27599;&#20010;&#22359;&#26159;1KB&#65292;&#24212;&#35813;&#26377;1024&#20010;&#22359;&#65292;&#38500;&#21435;&#21551;&#21160;&#22359;&#36824;&#26377;1023&#20010;&#22359;&#65292;&#20998;&#21035;&#32534;
   &#21495;&#20026;1-1023&#65292;&#23427;&#20204;&#20840;&#37117;&#23646;&#20110;Group 0&#12290;&#20854;&#20013;&#65292;Block 1&#26159;&#36229;&#32423;&#22359;&#65292;&#25509;&#19979;&#26469;&#30340;&#22359;&#32452;&#25551;&#36848;&#31526;&#25351;&#20986;&#65292;
   &#22359;&#20301;&#22270;&#26159;Block 6&#65292;&#22240;&#27492;&#20013;&#38388;&#30340;Block 2-5&#26159;&#22359;&#32452;&#25551;&#36848;&#31526;&#34920;&#65292;&#20854;&#20013;Block 3-5&#20445;&#30041;&#26410;&#29992;&#12290;&#22359;
   &#32452;&#25551;&#36848;&#31526;&#36824;&#25351;&#20986;&#65292;inode&#20301;&#22270;&#26159;Block 7&#65292;inode&#34920;&#26159;&#20174;Block 8&#24320;&#22987;&#30340;&#65292;&#37027;&#20040;inode&#34920;&#21040;&#21738;
   &#20010;&#22359;&#32467;&#26463;&#21602;&#65311;&#30001;&#20110;&#36229;&#32423;&#22359;&#20013;&#25351;&#20986;&#27599;&#20010;&#22359;&#32452;&#26377;128&#20010;inode&#65292;&#27599;&#20010;inode&#30340;&#22823;&#23567;&#26159;128&#23383;&#33410;&#65292;&#22240;
   &#27492;&#20849;&#21344;16&#20010;&#22359;&#65292;inode&#34920;&#30340;&#33539;&#22260;&#26159;Block 8-23,
   <span class="org-link">file:../download/fs.datablock.png</span>
   &#25152;&#20197;&#25968;&#25454;&#22359;&#20174;&#31532;24block&#24320;&#22987; 24*1024 =0x6000

   &#25968;&#25454;&#22359;&#37324;&#30340;&#35760;&#24405;&#26159;&#19981;&#23450;&#38271;&#30340;&#65292;
   &#32467;&#26500;&#26159;
<span class="org-block-begin-line">   #+BEGIN_QUOTE
</span>   inode&#21495;&#65288;4bytes&#65289;|&#35760;&#24405;&#38271;&#24230;   (2bytes)|filename length(1byte)|filetype(1byte)|filename(&#19981;&#23450;&#38271;)|<span class="org-meta-line">
</span><span class="org-block-end-line">   #+END_QUOTE
</span>   &#19978;&#22270;&#20013;&#20998;&#21035;&#26174;&#31034; &#20102; . .. lost+found
<span class="org-block-begin-line">   #+BEGIN_QUOTE
</span>   00006000: 0200 0000 0c00 0102 2e00 0000 0200 0000  ................
   00006010: 0c00 0202 2e2e 0000 0b00 0000 1400 0a02  ................
   00006020: 6c6f 7374 2b66 6f75 6e64 0000 0c00 0000  lost+found......
   00006030: 1000 0501 6865 6c6c 6f00 0000 0d00 0000  ....hello.......<span class="org-meta-line">
</span><span class="org-block-end-line">   #+END_QUOTE
</span>   &#20197;&#19978;&#20869;&#23481;&#20998;&#21035;&#26159;
<span class="org-block-begin-line">   #+BEGIN_QUOTE
</span>   0200 0000 &#23545;&#24212;&#30340;inode&#21495;&#26159;0x00000002 ,
   0c00 &#27492;&#26465;&#35760;&#24405;&#20849;&#38271; 12 (0x000c=12),
   01 filename&#21517;&#38271;&#24230;&#26159;1,
   02 filetype &#26159;2,&#34920;&#31034;&#30446;&#24405;
   2e00 0000   0x00000023 &#26159; "." ,&#21363;/&#30446;&#24405;&#19979;&#30340;"."
   &#36825;&#20960;&#20010;&#23383;&#33410;&#25968;&#25968;&#27491;&#22909;&#26159;12bytes<span class="org-meta-line">
</span><span class="org-block-end-line">   #+END_QUOTE
</span>   &#25509;&#19979;&#30340;&#26469;&#25551;&#36848;&#30340;&#26159; ".."
<span class="org-block-begin-line">   #+BEGIN_QUOTE
</span>   0200 0000
   0c00 0202 2e2e 0000<span class="org-meta-line">
</span><span class="org-block-end-line">   #+END_QUOTE
</span>   &#25509;&#19979;&#26469;&#30340;&#25551;&#36848;&#30340;&#26159;"lost+found"
<span class="org-block-begin-line">   #+BEGIN_QUOTE
</span>   0b00 0000 1400 0a02
   6c6f 7374 2b66 6f75 6e64 0000
   &#23545;&#24212;0b00 0000 ,0x0000000b&#21495;inode,&#21363;&#31532;11&#20010;inode
   1400 &#65292;0x0014&#34920;&#31034;&#65292;&#27492;&#31243;&#35760;&#24405;&#20849;&#21344;&#29992;20byte,
   0a &#25991;&#20214;&#38271;&#24230;&#26159;10,
   02 &#25991;&#20214;&#31867;&#22411;&#26159;&#30446;&#24405;
   6c6f 7374 2b66 6f75 6e64 &#26159;lost+found&#20960;&#20010;&#23383;,
   &#20320;&#21487;&#20197;&#25226;&#8220;lost+found&#8221;&#20889;&#21040;&#19968;&#20010;&#25991;&#20214;&#20013;&#65292;&#29992;&#21313;&#20845;&#36827;&#21046;&#32534;&#36753;&#22120;&#26597;&#30475;
   ,&#26368;&#21518;&#37027;4&#20010;0&#19981;&#22826;&#29702;&#35299;&#12290;<span class="org-meta-line">
</span><span class="org-block-end-line">   #+END_QUOTE
</span>
<span class="org-level-1">* &#21487;&#29992;&#30340;&#21629;&#20196;</span>
  dumpe2fs

<span class="org-level-1">* &#31995;&#32479;&#20989;&#25968;</span>
<span class="org-block-begin-line">  #+BEGIN_SRC c
</span><span class="org-block">    #include &lt;stdio.h&gt;
    #include &lt;dirent.h&gt;
    #include &lt;string.h&gt;
    #include &lt;stdlib.h&gt;

    /* struct dirent { */
    /*  ino_t          d_ino;       /\* inode number *\/ */
    /*  off_t          d_off;       /\* offset to the next dirent *\/ */
    /*  unsigned short d_reclen;    /\* length of this record *\/ */
    /*  unsigned char  d_type;      /\* type of file *\/ */
    /*  char           d_name[256]; /\* filename *\/ */
    /* }; */

    int main(int argc, char *argv[])
    {
      struct dirent *dp;
      DIR *dfd;
      if((dfd= opendir("/tmp/d/"))==NULL){
        fprintf(stderr,"opendir error");
        exit(1);
      }
      while( (dp = readdir(dfd))!=NULL){
        fprintf(stdout,"%s\n",dp-&gt;d_name);
      }
      closedir(dfd);
      return 0;
    }
</span><span class="org-block-end-line">  #+END_SRC
</span></pre>
  </body>
</html>
