<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.34 in css mode. -->
<html>
  <head>
    <title>y.org</title>
    <style type="text/css">
    <!--
      body {
        color: #F8F8F8;
        background-color: #0C1021;
      }
      .comment {
        /* font-lock-comment-face */
        color: #AEAEAE;
        font-style: italic;
      }
      .org-document-info {
        /* org-document-info */
        color: #afeeee;
      }
      .org-document-info-keyword {
        /* org-document-info-keyword */
        color: #b3b3b3;
      }
      .org-document-title {
        /* org-document-title */
        color: #afeeee;
        font-size: 144%;
        font-weight: bold;
      }
      .org-meta-line {
        /* org-meta-line */
        color: #AEAEAE;
        font-style: italic;
      }

      a {
        color: inherit;
        background-color: inherit;
        font: inherit;
        text-decoration: inherit;
      }
      a:hover {
        text-decoration: underline;
      }
    -->
    </style>
  </head>
  <body>
    <pre>
<span class="comment"># -*- coding:utf-8 -*-</span>
<span class="org-meta-line">#+LANGUAGE:  zh
</span><span class="org-document-info-keyword">#+TITLE:</span><span class="comment">     </span><span class="org-document-title">&#22812;&#33394;&#32548;&#32439;</span>
<span class="org-document-info-keyword">#+AUTHOR:</span><span class="comment">    </span><span class="org-document-info">&#32426;&#31168;&#23792;</span>
<span class="org-document-info-keyword">#+EMAIL:</span><span class="comment">     </span><span class="org-document-info">jixiuf@gmail.com</span>
<span class="org-document-info-keyword">#+DATE:</span><span class="comment">     </span><span class="org-document-info">2012-07-08 &#26085;</span>
<span class="org-meta-line">#+DESCRIPTION:y.org
#+KEYWORDS: 
#+OPTIONS:   H:2 num:nil toc:t \n:t @:t ::t |:t ^:nil -:t f:t *:t &lt;:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil 
#+FILETAGS: 
</span>
&#22791;&#27880; &#65306;&#65306;&#65306;&#65306;&#65306;&#65306;&#20854;&#20013;&#22823;&#37096;&#20998;&#26159;&#32993;&#35328;&#20081;&#35821;&#65292;&#26356;&#26377;&#19968;&#20123;&#29392;&#29432;&#25165;&#20250;&#35828;&#30340;&#35805;&#65292;&#33258;&#28982;&#20805;&#19981;&#24471;&#30495;&#65292;&#65292;&#32735;&#26576;&#26576;&#24050;&#19979;
&#20102;&#8220;&#25955;&#32780;&#26080;&#21619;&#8221;&#35780;&#35821;&#65288;&#22823;&#24847;&#22914;&#27492;&#65289;&#65292;&#25152;&#20197;&#25105;&#36830;&#35878;&#34394;&#30340;&#36164;&#26684;&#37117;&#27809;&#26377;&#65292;&#33021;&#25615;&#19968;&#31505;&#20415;&#22815;&#20102;&#65292;&#20294;&#24895;&#30475;&#20102;&#19981;&#39554;&#25105;&#20415;
&#30693;&#36275;&#20102;&#65292;&#24403;&#28982;&#25925;&#20107;&#37117;&#26159;&#20551;&#30340;&#8221;&#12290;

&#22791;&#27880;&#20108;&#65306;&#27492;&#25991;&#26159;&#21018;&#19978;&#22823;&#19968;&#26102;&#25152;&#20889;&#65288;&#22914;&#20170;&#22823;&#22235;&#23558;&#36807;&#19968;&#21322;&#65289;&#65292;&#39640;&#20013;&#26102;&#26366;&#24819;&#36807;&#35201;&#20889;&#20123;&#19996;&#35199;&#65292;&#28982;&#21518;&#20960;&#32463;&#25340;&#20945;&#65292;&#20960;
&#32463;&#25628;&#21038;&#65292;&#26041;&#25104;&#27492;&#25991; &#12290;&#35835;&#36807;&#38065;&#38047;&#20070;&#30340;&#19968;&#20123;&#20316;&#21697;&#65292;&#24456;&#26159;&#21916;&#27426;&#65292;&#28982;&#21518;&#26497;&#21147;&#27169;&#20223;&#12290;&#21322;&#24180;&#20043;&#21518;&#65292;&#20415;&#24456;
&#23569;&#30475;&#20070;&#65292;&#26356;&#23569;&#20889;&#23383;&#20102;&#12290;&#21069;&#20960;&#26085;&#27880;&#20876;&#20102;&#36825;&#20010;&#21338;&#23458;&#65292;&#21457;&#29616;&#20889;&#19981;&#20986;&#20160;&#20040;&#19996;&#35199;&#20102;&#65292;&#32763;&#20986;&#36148;&#22312;&#27492;&#22788;&#65292;&#31639;&#26159;&#23545;&#36825;&#22823;&#23398;&#22235;&#24180;&#30340;&#19968;&#28857;&#32426;&#24565;&#21543;&#65292;&#20063;&#39034;&#20415;&#32473;&#36825;&#20010;&#21338;&#23458;&#28155;&#28857;&#25991;&#23383;&#12290;
 
  &#22812;&#33394;&#40655;&#31264;&#24471;&#22914;&#21516;&#20908;&#22825;&#27249;&#26700;&#37324;&#30340;&#19968;&#30871;&#38548;&#22812;&#40060;&#27748;&#65292;&#21363;&#20415;&#12298;&#32842;&#25995;&#24535;&#24322;&#12299;&#37324;&#30340;&#29483;&#22934;&#36208;&#20986;&#20070;&#26469;&#65292;&#20063;&#35201;
&#25265;&#24616;&#36825;&#22812;&#26263;&#24471;&#22826;&#27809;&#22825;&#29702;&#12290;&#32780;&#26657;&#22253;&#37324;&#30340;&#36335;&#28783;&#25955;&#21457;&#20986;&#30340;&#20809;&#28909;&#33485;&#30333;&#24471;&#21482;&#20687;&#30871;&#37324;&#23884;&#22312;&#27748;&#37324;&#30340;&#40060;&#21050;&#65292;&#21482;
&#22815;&#21560;&#24341;&#25955;&#20853;&#28216;&#21191;&#30340;&#39134;&#34558;&#25928;&#37027;&#8220;&#25169;&#28779;&#8221;&#30340;&#34850;&#34892;&#65292;&#23427;&#20204;&#20840;&#19981;&#30693;&#37027;&#19981;&#26159;&#28779;&#12290;&#20294;&#36825;&#31181;&#24433;&#24433;&#32496;&#32496;&#20134;&#30495;&#20134;
&#24187;&#30340;&#26406;&#32999;&#27668;&#27675;&#24688;&#26159;&#22823;&#23398;&#26657;&#22253;&#37324;&#25152;&#24613;&#38656;&#30340;&#12290;&#37027;&#20123;&#21018;&#21018;&#33073;&#31163;&#29238;&#27597;&#32422;&#26463;&#65292;&#25379;&#33073;&#25945;&#24072;&#30475;&#31649;&#30340;&#21487;&#24604;&#23398;&#29983;
&#27491;&#26159;&#35753;&#20154;&#29233;&#65292;&#23547;&#20154;&#29233;&#65292;&#22857;&#29486;&#29233;&#65292;&#21516;&#26102;&#27714;&#20154;&#26045;&#33293;&#20123;&#27531;&#20313;&#30340;&#29233;&#30340;&#26102;&#20505;&#65292;&#32780;&#36825;&#40655;&#31264;&#30340;&#22812;&#33394;&#20687;&#28145;&#35865;&#20026;
&#23448;&#20043;&#36947;&#30340;&#23448;&#21519;&#65292;&#20945;&#36259;&#22320;&#25340;&#20945;&#20986;&#20102;&#20379;&#24180;&#36731;&#30007;&#22899;&#24651;&#29233;&#30340;&#38745;&#23490;&#24189;&#26263;&#27675;&#22260;&#12290;

   &#20551;&#20351;&#20320;&#38543;&#20415;&#21521;&#26576;&#20010;&#32511;&#38452;&#28145;&#22788;&#65292;&#25233;&#25110;&#37027;&#28783;&#20809;&#21450;&#19981;&#21040;&#30340;&#31354;&#26103;&#25805;&#22330;&#30597;&#19978;&#20960;&#30524;&#65292;&#23601;&#20250;&#24456;&#23481;&#26131;&#21457;&#29616;&#19981;
&#23569;&#20986;&#21452;&#20837;&#23545;&#30340;&#36523;&#24433;&#12290;&#20294;&#26159;&#26377;&#20363;&#22914;&#38590;&#20813;&#23601;&#20250;&#26377;&#20363;&#22806;&#12290;&#32511;&#38452;&#20043;&#19979;&#65292;&#21494;&#21326;&#19981;&#26080;&#24774;&#24581;&#22320;&#36208;&#22312;&#26263;&#28129;&#28783;&#20809;
&#38138;&#23601;&#30340;&#20731;&#38745;&#36335;&#38754;&#19978;&#65292;&#23396;&#20278;&#20278;&#30340;&#19968;&#20010;&#36523;&#24433;&#65292;&#24825;&#24471;&#36523;&#21518;&#26406;&#32999;&#30340;&#22812;&#33394;&#24525;&#19981;&#20303;&#24819;&#39554;&#22905;&#19981;&#30693;&#29645;&#24796;&#65292;&#36764;&#36127;
&#20102;&#22823;&#22909;&#26102;&#20809;&#65292;&#28010;&#36153;&#20102;&#23427;&#30340;&#19968;&#30058;&#24515;&#34880;&#65292;&#21487;&#26159;&#21448;&#26377;&#35841;&#30495;&#27491;&#20102;&#35299;&#22905;&#30340;&#24515;&#24773;&#21602;&#65311;&#32463;&#21382;&#20102;&#20170;&#26202;&#65292;&#21494;&#21326;&#31361;
&#28982;&#24863;&#35273;&#24515;&#37324;&#26377;&#20123;&#31354;&#33853;&#33853;&#30340;&#12290;&#20687;&#25746;&#20102;&#27668;&#30340;&#30382;&#29699;&#65292;&#33073;&#20102;&#21457;&#30340;&#38738;&#24180;&#65292;&#38750;&#20294;&#27809;&#26377;&#36731;&#26494;&#30340;&#24863;&#35273;&#65292;&#21453;&#32780;&#26377;
&#19968;&#31181;&#26080;&#29289;&#21487;&#25215;&#65292;&#26080;&#20107;&#21487;&#25285;&#30340;&#34394;&#39128;&#12290;&#35802;&#28982;&#65292;&#34987;&#20154;&#29233;&#32780;&#21448;&#19981;&#24895;&#29233;&#20154;,&#26377;&#26102;&#38590;&#20813;&#20250;&#26377;&#25910;&#20102;&#38065;&#32780;&#24597;&#25343;&#19981;
&#20986;&#36135;&#30340;&#25285;&#24515;&#65292;&#24515;&#37324;&#32769;&#26377;&#21069;&#19990;&#27424;&#20102;&#20154;&#23478;&#30340;&#24863;&#35273;&#12290;&#29233;&#24773;&#26159;&#29980;&#34588;&#30340;&#65307;&#20294;&#24403;&#29233;&#24773;&#36315;&#20102;&#33050;&#65292;&#26029;&#20102;&#36275;&#26102;&#65292;
&#21364;&#36716;&#30524;&#25104;&#20102;&#19968;&#31181;&#25703;&#20154;&#24515;&#39592;&#65292;&#26029;&#20154;&#32925;&#32928;&#30340;&#36127;&#25285;&#12290;

   &#21494;&#21326;&#21018;&#21018;&#20174;&#36825;&#31181;&#36127;&#25285;&#20013;&#35299;&#33073;&#20986;&#26469;&#65292;&#20294;&#21364;&#24590;&#20040;&#20063;&#39640;&#20852;&#19981;&#36215;&#26469;&#12290;&#21448;&#19968;&#22330;&#28216;&#25103;&#32467;&#26463;&#20102;&#65292;&#19981;&#38169;&#65292;&#21482;
&#26159;&#19968;&#22330;&#28216;&#25103;&#65292;&#21482;&#26159;&#22905;&#28843;&#20029;&#38738;&#26149;&#20013;&#30340;&#19968;&#28857;&#28857;&#32512;&#65292;&#22905;&#24182;&#19981;&#25171;&#31639;&#25918;&#22312;&#24515;&#19978;&#12290;&#20294;&#26159;&#20687;&#30475;&#23436;&#19968;&#22330;&#20932;&#32654;&#30340;
&#30005;&#24433;&#65292;&#35835;&#23436;&#19968;&#37096;&#21696;&#24616;&#30340;&#23567;&#35828;&#65292;&#38543;&#30528;&#20027;&#20154;&#32705;&#32463;&#21382;&#20102;&#19968;&#27573;&#19981;&#24179;&#20961;&#30340;&#32463;&#21382;&#65292;&#24453;&#24471;&#30475;&#23436;&#32467;&#23616;,&#35835;&#33267;&#20070;&#23614;&#65292;
&#24515;&#22836;&#31455;&#26377;&#19968;&#19997;&#26367;&#21476;&#20154;&#25285;&#24551;&#30340;&#21696;&#20260;&#12290;

   &#20687;&#19968;&#22330;&#28216;&#25103;&#21487;&#20197;&#32473;&#20154;&#24102;&#26469;&#24863;&#23448;&#21050;&#28608;&#65292;&#21516;&#26102;&#21448;&#33021;&#25307;&#20154;&#19978;&#30270;&#30528;&#36855;&#19968;&#26679;&#65292;&#29233;&#24773;&#28216;&#25103;&#21516;&#26679;&#35753;&#35768;&#22810;&#20154;
&#29976;&#24515;&#33251;&#26381;&#12290;&#20294;&#30495;&#27491;&#30340;&#39640;&#25163;&#19981;&#20294;&#25026;&#24471;&#22914;&#20309;&#20139;&#21463;&#28216;&#25103;&#30340;&#21050;&#28608;,&#26356;&#25026;&#24471;&#20309;&#26102;&#20174;&#28216;&#25103;&#20013;&#36867;&#20986; &#12290;&#21494;&#21326;&#26080;
&#30097;&#26159;&#19968;&#20010;&#28216;&#25103;&#39640;&#25163; &#12290;&#28216;&#25103;&#35813;&#32467;&#26463;&#20102;&#65292;&#26159;&#26102;&#20505;&#35828;&#19981;&#20102;&#12290;&#22905;&#26159;&#36825;&#20040;&#24819;&#30340;&#65292;&#20063;&#30830;&#23454;&#36825;&#20040;&#20570;&#20102;&#12290;&#22905;&#30693;
&#36947;&#33509;&#20877;&#19981;&#25298;&#32477;&#65292;&#25509;&#19979;&#26469;&#20250;&#21457;&#29983;&#20160;&#20040;&#12290;&#22905;&#20102;&#35299;&#32834;&#26494;--&#34429;&#28982;&#32834;&#26494;&#24182;&#19981;&#20102;&#35299;&#22905;&#65292;&#32834;&#26494;&#26159;&#19968;&#20010;&#20160;&#20040;&#37117;
&#24178;&#24471;&#20986;&#30340;&#20154;&#12290;&#21494;&#21326;&#24515;&#37324;&#22066;&#31505;&#32834;&#26494;&#37027;&#32929;&#23376;&#29378;&#20658;&#30340;&#20914;&#21170;&#65292;&#20294;&#21516;&#26102;&#21448;&#23545;&#36825;&#32929;&#23376;&#20914;&#21170;&#20805;&#28385;&#20102;&#30031;&#24807;&#65292;&#20687;
&#34769;&#34690;&#25171;&#24515;&#30524;&#37324;&#30631;&#19981;&#36215;&#32966;&#23567;&#30340;&#22899;&#20154;&#65292;&#21516;&#26102;&#21448;&#19981;&#26080;&#30031;&#24807;&#22320;&#25552;&#38450;&#30528;&#22905;&#20204;&#38543;&#26102;&#21487;&#33021;&#29190;&#21457;&#20986;&#30340;&#30772;&#37340;&#27785;&#33311;
&#33324;&#30340;&#21191;&#27668;&#19968;&#26679;&#12290;

   &#26657;&#22253;&#30340;&#36335;&#24182;&#19981;&#38271;&#65292;&#19981;&#20960;&#20998;&#38047;&#65292;&#21494;&#21326;&#20415;&#21040;&#20102;&#22905;&#29087;&#24713;&#30340;&#22899;&#29983;&#20844;&#23507;&#12290;&#33039;&#20081;&#30340;&#27004;&#36947;&#65292;&#22024;&#26434;&#30340;&#22768;&#38899;&#65292;
&#35753;&#36825;&#20010;&#19968;&#21521;&#26377;&#27905;&#30294;&#30340;&#22899;&#29983;&#24863;&#21040;&#30001;&#34935;&#30340;&#37057;&#38391;&#21644;&#26080;&#22856;&#12290;&#19981;&#30693;&#26159;&#20037;&#22788;&#40077;&#40060;&#20043;&#32902;&#32780;&#19981;&#35273;&#20854;&#33261;&#65292;&#25233;&#25110;&#20854;
&#20182;&#20160;&#20040;&#21407;&#22240;&#65292;&#26368;&#36817;&#21494;&#21326;&#31455;&#19982;&#36825;&#30772;&#36133;&#30340;&#20844;&#23507;&#24444;&#27492;&#30456;&#23433;&#12290;&#20294;&#21494;&#21326;&#24182;&#19981;&#36825;&#20040;&#35748;&#20026;&#12290;&#8220;&#27809;&#27861;&#25913;&#21464;&#30340;&#20107;
&#23454;&#65292;&#37027;&#23601;&#22374;&#28982;&#25509;&#21463;&#21543;&#65281;&#8221;&#36825;&#26159;&#21494;&#21326;&#33258;&#25105;&#23433;&#24944;&#30340;&#24515;&#22768;&#12290;&#22914;&#27492;&#22320;&#35692;&#37322;&#65292;&#35828;&#26126;&#20102;&#22905;&#24182;&#38750;&#32902;&#20013;&#20043;&#40060;&#65292;
&#20294;&#26159;&#37257;&#20102;&#30340;&#20154;&#24635;&#22228;&#30528;&#35828;&#27809;&#37257;&#65292;&#22352;&#24109;&#30340;&#23458;&#20154;&#24635;&#31505;&#21621;&#21621;&#22320;&#35828;&#39281;&#20102;&#65292;&#25105;&#20204;&#19981;&#22952;&#38468;&#21644;&#30528;&#35828;&#65292;&#22905;&#19981;&#26159;&#12290;

   &#36716;&#20837;&#23487;&#33293;&#27004;&#65292;&#36814;&#38754;&#26159;&#19968;&#38754;&#19968;&#20154;&#22810;&#39640;&#30340;&#22823;&#38236;&#23376;&#12290;&#38236;&#38754;&#19978;&#37096;&#19968;&#26525;&#20439;&#19981;&#21487;&#32784;&#32780;&#21448;&#19981;&#30693;&#23506;&#31384;&#30340;&#32418;&#26757;
&#20658;&#28982;&#24594;&#25918;&#65292;&#21494;&#21326;&#26366;&#22810;&#27425;&#20195;&#36825;&#38754;&#36214;&#19981;&#19978;&#28526;&#27969;&#65292;&#36319;&#19981;&#19978;&#33050;&#27493;&#30340;&#38236;&#23376;&#25265;&#24871;&#65292;&#20294;&#26159;&#24403;&#30475;&#21040;&#38236;&#38754;&#37324;&#30340;&#20426;
&#20431;&#38754;&#23481;&#26102;&#65292;&#21494;&#21326;&#24515;&#23433;&#20102;&#65292;&#19981;&#20877;&#35745;&#36739;&#23427;&#30340;&#33853;&#20237;&#19982;&#21542;&#12290;&#27599;&#27425;&#36208;&#36807;&#22823;&#21381;&#65292;&#21494;&#21326;&#37117;&#20250;&#33258;&#35273;&#19981;&#33258;&#35273;&#22320;&#36208;
&#21040;&#38236;&#21069;&#25314;&#19968;&#25314;&#22905;&#30340;&#31168;&#21457;&#12290;&#19968;&#22914;&#24448;&#24120;&#65292;&#21494;&#21326;&#20174;&#38236;&#20013;&#30475;&#21040; &#20102;&#33258;&#24049;&#39640;&#25361;&#30340;&#36523;&#24433;&#65292;&#19968;&#36523;&#21512;&#36523;&#30340;&#30333;&#33394;&#32433;
&#36136;&#34924;&#34915;&#26381;&#26381;&#36148;&#36148;&#22320;&#28508;&#20239;&#22312;&#22905;&#30340;&#36523;&#21608;&#65292;&#31216;&#32844;&#22320;&#26174;&#31034;&#20986;&#20102;&#22899;&#20027;&#20154;&#21248;&#31216;&#30340;&#36523;&#26448;&#12290;&#19968;&#21103;&#30130;&#24811;&#30340;&#31070;&#33394;&#26356;
&#22686;&#20102;&#22905;&#22899;&#24615;&#30340;&#32420;&#24369;&#12290;&#21494;&#21326;&#23545;&#30528;&#38236;&#20013;&#30340;&#33258;&#24049;&#31505;&#20102;&#31505;&#65292;&#21487;&#26159;&#31361;&#28982;&#21457;&#29616;&#36825;&#31505;&#26159;&#37027;&#20040;&#22320;&#33485;&#30333;&#65292;&#20687;&#21018;&#21018;
&#29123;&#23613;&#30340;&#26543;&#26525;&#65292;&#34429;&#20855;&#20854;&#24418;&#65292;&#21364;&#32463;&#19981;&#36215;&#19968;&#38453;&#39118;&#21561;&#36807;&#12290;&#21494;&#21326;&#27627;&#27809;&#26469;&#30001;&#22320;&#24680;&#33258;&#24049;&#65292;&#35273;&#24471;&#33258;&#24049;&#22909;&#27809;&#29992;&#12290;

   &#38236;&#23376;&#20559;&#24038;&#65292;&#20415;&#26159;&#36890;&#21521;&#21494;&#21326;&#23517;&#23460;&#30340;&#27004;&#26799;&#65292;&#40657;&#40669;&#40669;&#30340;&#22320;&#38754;&#25581;&#38706;&#20102;&#23487;&#33293;&#27004;&#30340;&#24180;&#20195;&#20037;&#36828;&#65292;&#35777;&#23454;&#30528;&#23487;
&#33293;&#27004;&#30340;&#23453;&#36149;&#21382;&#21490;&#20215;&#20540;&#12290;&#27004;&#26799;&#19981;&#30693;&#26159;&#24590;&#20040;&#29228;&#30340;&#65292;&#21040;&#20102;&#20108;&#27004;&#65292;&#36716;&#36807;&#19968;&#20010;&#25296;&#35282;&#65292;&#27809;&#22810;&#36828;&#23601;&#26159;&#21494;&#21326;&#30340;
&#23517;&#23460;&#20102;&#12290;&#38376;&#24212;&#25163;&#32780;&#24320;&#65292;&#37324;&#38754;&#29031;&#26679;&#26159;&#20960;&#20010;&#23460;&#21451;&#26377;&#19968;&#21477;&#27809;&#19968;&#21477;&#22320;&#32842;&#30528;&#65292;&#22825;&#21335;&#28023;&#21271;&#65292;&#26080;&#25152;&#19981;&#21253;&#12290;&#20869;
&#23481;&#30340;&#28041;&#21450;&#38754;&#19981;&#27604;&#34434;&#34433;&#30340;&#21183;&#21147;&#33539;&#22260;&#23567;&#65292;&#35752;&#35770;&#24471;&#28145;&#24230;&#21364;&#21482;&#33021;&#22815;&#20572;&#30041;&#22312;&#34920;&#38754;&#19978;&#12290;&#22240;&#20026;&#26222;&#22825;&#20043;&#19979;&#65292;&#22269;
&#23478;&#34429;&#22810;&#65292;&#21364;&#36824;&#27809;&#26377;&#21738;&#19968;&#23478;&#21378;&#21830;&#29983;&#20135;&#20986;&#20869;&#26381;&#30340;&#21270;&#22918;&#21697;&#12290;&#24403;&#28982;&#65292;&#21494;&#21326;&#20063;&#20250;&#21442;&#19982;&#36827;&#21435;&#65292;&#19981;&#36807;&#20170;&#26202;&#22905;
&#22909;&#20687;&#27809;&#36825;&#20010;&#24515;&#24773;&#12290;&#21482;&#31616;&#21333;&#22320;&#25307;&#21628;&#19968;&#22768;&#65292;&#20415;&#21040;&#20102;&#22905;&#30340;&#21351;&#38138;&#21069;&#12290;&#36523;&#24515;&#30340;&#30130;&#24811;&#25958;&#20419;&#22905;&#36214;&#32039;&#20241;&#24687;&#65292;&#20294;
&#19968;&#21521;&#29233;&#27905;&#30340;&#21494;&#21326;&#21364;&#20174;&#19981;&#24895;&#33609;&#33609;&#20102;&#20107;&#65292;&#30828;&#26159;&#25302;&#30528;&#30130;&#22791;&#30340;&#36523;&#24515;&#65292;&#27927;&#21047;&#20102;&#19968;&#36941;&#25165;&#23433;&#38745;&#22320;&#36538;&#21040;&#24202;&#19978;&#12290;
&#36825;&#20010;&#23039;&#21183;&#35753;&#21494;&#21326;&#24863;&#21040;&#26080;&#27604;&#22320;&#28902;&#38391;&#65292;&#22240;&#20026;&#65292;&#33034;&#26609;&#19979;&#30340;&#38081;&#24202;&#27491;&#25240;&#30952;&#30528;&#22905;&#23047;&#24369;&#30340;&#36523;&#36527;&#65292;&#34429;&#28982;&#38548;&#30528;&#19968;
&#23618;&#26517;&#22836;&#65292;&#20294;&#37027;&#24863;&#35273;&#21364;&#28165;&#26224;&#24471;&#20687;&#35797;&#21367;&#19978;&#20570;&#38169;&#30340;&#39064;&#30446;&#65292;&#19997;&#35946;&#19981;&#23481;&#22905;&#24576;&#30097;&#12290;&#20110;&#26159;&#65292;&#21494;&#21326;&#21448;&#19968;&#27425;&#24819;&#21040;
&#22905;&#23478;&#37324;&#24202;&#19978;&#30340;&#29609;&#20855;&#29066;&#65292;&#39034;&#20415;&#24819;&#36215;&#20102;&#22905;&#28201;&#26262;&#30340;&#23478;&#12290;

   &#21494;&#21326;&#19981;&#26159;&#26412;&#22320;&#20154;&#65292;&#22905;&#23478;&#22312;&#21335;&#26041;&#65292;&#29238;&#20146;&#26159;&#19968;&#23478;&#23567;&#20844;&#21496;&#30340;&#32463;&#29702;&#65292;&#34429;&#28982;&#29983;&#24847;&#24182;&#19981;&#28779;&#27668;&#65292;&#21364;&#20063;&#24182;&#19981;
&#20919;&#28165;&#65292;&#21494;&#23478;&#21482;&#22905;&#19968;&#20010;&#22899;&#20799;&#65292;&#27597;&#20146;&#25226;&#22905;&#24403;&#23453;&#23456;&#30528;&#65292;&#29238;&#20146;&#33251;&#26381;&#20110;&#27597;&#20146;&#65292;&#20063;&#38468;&#21644;&#30528;&#27597;&#20146;&#21512;&#21147;&#23456;&#30528;&#22899;
&#20799;&#12290;&#20174;&#23567;&#36865;&#22905;&#21435;&#23398;&#38050;&#29748;&#65292;&#32451;&#21809;&#27468;&#65292;&#39034;&#20415;&#21448;&#23398;&#19978;&#20102;&#33310;&#36424;&#12290;&#36807;&#31243;&#34429;&#28982;&#36763;&#33510;&#65292;&#20294;&#24403;&#24212;&#29238;&#27597;&#36992;&#65292;&#22312;&#23458;
&#20154;&#38754;&#21069;&#28436;&#22863;&#19968;&#26354;&#65292;&#39640;&#27468;&#19968;&#39318;&#65292;&#32780;&#25615;&#24471;&#20247;&#20154;&#30340;&#25484;&#22768;&#26102;&#65292;&#21494;&#21326;&#40664;&#40664;&#25509;&#21463;&#20102;&#36825;&#20221;&#36763;&#33510;&#12290;&#24180;&#23681;&#28176;&#38271;&#65292;
&#20837;&#20102;&#20013;&#23398;&#65292;&#28436;&#20986;&#24840;&#21152;&#39057;&#32321;&#65292;&#22312;&#21508;&#31181;&#27963;&#21160;&#20013;&#30340;&#39057;&#32321;&#20142;&#30456;&#26356;&#35753;&#22905;&#24515;&#37324;&#20687;&#25273;&#20102;&#34588;&#20284;&#30340;&#29980;&#12290;&#20294;&#36825;&#20221;&#29980;
&#26159;&#19981;&#33021;&#25273;&#21040;&#33080;&#19978;&#30340;&#65292;&#22240;&#20026;&#23427;&#20250;&#25307;&#26469;&#21507;&#19981;&#21040;&#33889;&#33796;&#30340;&#29392;&#29432;&#35828;&#33889;&#33796;&#37240;&#12290;&#20037;&#32780;&#20037;&#20043;&#65292;&#20415;&#20859;&#25104;&#20102;&#22905;&#33853;&#33853;
&#33258;&#36175;&#30340;&#24615;&#26684;&#12290;&#26377;&#20154;&#35828;&#22905;&#39640;&#20658;&#65292;&#20294;&#22899;&#20154;&#30340;&#39640;&#20658;&#26159;&#23545;&#30007;&#20154;&#31934;&#31070;&#30340;&#25361;&#36887;&#65292;&#27491;&#22909;&#27604;&#35302;&#20043;&#19981;&#21487;&#21450;&#30340;&#33889;&#33796;
&#20559;&#33021;&#25307;&#26469;&#35828;&#33889;&#33796;&#37240;&#30340;&#29392;&#29432;&#12290;&#22899;&#20154;&#30340;&#22810;&#25165;&#22810;&#33402;&#19982;&#26234;&#21830;&#25104;&#21453;&#27604;&#65292;&#25152;&#20197;&#65292;&#21494;&#21326;&#30340;&#39640;&#32771;&#34429;&#28982;&#8220;&#32771;&#8221;&#20102;
&#25104;&#32489;&#21364;&#24182;&#19981;&#8220;&#39640;&#8221;&#12290;&#20960;&#32463;&#21608;&#25240;&#36759;&#36716;&#21040;&#20102;&#20170;&#22825;&#36825;&#25152;&#22823;&#23398;&#12290;&#24320;&#23398;&#30340;&#31532;&#19968;&#22825;&#20415;&#25171;&#30862;&#20102;&#22905;&#23545;&#22823;&#23398;&#30340;&#24187;
&#24819;&#12290;&#19968;&#26635;&#26635;&#23487;&#33293;&#27004;&#38472;&#26087;&#24471;&#20687;&#21069;&#28165;&#33104;&#26429;&#30340;&#24605;&#24819;&#12290;&#21482;&#27492;&#19968;&#28857;&#20415;&#35753;&#21494;&#21326;&#22823;&#22833;&#25152;&#26395;&#65292;&#20294;&#26408;&#24050;&#25104;&#33311;&#65292;&#27700;
&#24050;&#33853;&#22320;&#65292;&#21482;&#22909;&#39034;&#22825;&#30001;&#21629;&#65292;&#38543;&#23427;&#21435;&#20102;&#12290;&#21494;&#21326;&#19981;&#26159;&#19968;&#20010;&#23433;&#20110;&#29616;&#29366;&#30340;&#20154;&#65292;&#20294;&#20170;&#22825;&#20063;&#21482;&#22909;&#36825;&#26679;&#26080;&#22856;&#22320;
&#25509;&#21463;&#20102;&#12290;

    &#29983;&#27963;&#38543;&#30528;&#24320;&#23398;&#30340;&#26085;&#23376;&#24537;&#20081;&#20102;&#19968;&#38453;&#65292;&#36880;&#28176;&#22320;&#23433;&#38745;&#19979;&#26469;&#65292;&#27493;&#20837;&#20102;&#27491;&#36712;&#12290;&#21494;&#21326;&#30340;&#24515;&#24605;&#20063;&#20687;&#25243;&#20986;
&#30340;&#40060;&#32447;&#65292;&#34429;&#28982;&#27809;&#38035;&#19978;&#26469;&#40060;&#21364;&#20063;&#21482;&#22909;&#25910;&#22238;&#26469; &#65292;&#25918;&#22312;&#22260;&#22256;&#22905;&#30340;&#36825;&#19968;&#26041;&#27744;&#22616;&#12290;&#22905;&#24050;&#32463;&#25509;&#21463;&#20102;&#26082;&#25104;&#30340;
&#20107;&#23454;&#65292;&#20915;&#23450;&#20570;&#23567;&#27744;&#22616;&#37324;&#30340;&#19968;&#23614;&#32654;&#20154;&#40060;&#12290;&#20973;&#30528;&#22905;&#30340;&#22810;&#25165;&#22810;&#33402;&#65292;&#21644;&#22810;&#24180;&#31215;&#32047;&#30340;&#32463;&#39564;&#65292;&#22905;&#24456;&#23481;&#26131;&#20415;
&#25171;&#36827;&#20102;&#23398;&#29983;&#20250;&#12290;&#20511;&#30528;&#36814;&#26032;&#26202;&#20250;&#12289;&#38899;&#20048;&#20250;&#20197;&#21450;&#31181;&#31181;&#31867;&#20284;&#30340;&#23398;&#29983;&#27963;&#21160;&#65292;&#24456;&#24555;&#20415;&#22312;&#23398;&#29983;&#20013;&#23853;&#38706;&#22836;&#35282;&#12290;
&#20248;&#32654;&#30340;&#33310;&#23039;&#65292;&#21487;&#20154;&#30340;&#36523;&#27573;&#65292;&#30333;&#20928;&#32780;&#28165;&#31168;&#30340;&#38754;&#30382;&#65292;&#39640;&#20658;&#19981;&#20439;&#30340;&#27668;&#36136;&#65292;&#19981;&#23481;&#35768;&#22905;&#19981;&#21463;&#27426;&#36814;&#12290;&#20013;&#23398;
&#37324;&#30007;&#22899;&#21516;&#23398;&#38388;&#30340;&#20851;&#31995;&#20855;&#26377;&#25239;&#26085;&#25112;&#20105;&#26102;&#26399;&#20013;&#22269;&#20849;&#20135;&#20826;&#30340;&#20316;&#39118;&#65292;&#23558;&#28216;&#20987;&#25112;&#12289;&#25932;&#21518;&#25112;&#30340;&#31934;&#39635;&#21457;&#25381;&#21040;
&#26497;&#33268;,&#30524;&#33457;&#32557;&#20081;&#35753;&#20154;&#38450;&#19981;&#32988;&#38450;&#12290;&#32780;&#22823;&#23398;&#37324;&#30340;&#24651;&#29233;&#20415;&#36196;&#35064;&#35064;&#24471;&#20687;&#36164;&#26412;&#23478;&#30340;&#21093;&#21066;,&#19981;&#20294;&#19981;&#38656;&#38544;&#34109;&#65292;
&#21453;&#32780;&#23452;&#20110;&#22823;&#21152;&#23459;&#25196;&#12290;&#24680;&#19981;&#24471;&#19978;&#26657;&#20869;&#30340;&#24191;&#25773;&#65292;&#23637;&#31034;&#33258;&#24049;&#29454;&#29289;&#30340;&#20016;&#30427;&#65292;&#25112;&#32489;&#30340;&#36745;&#29004;&#65307;&#22635;&#20805;&#19968;&#19979;&#33192;
&#32960;&#30340;&#34394;&#33635;&#24515;&#12290;

    &#19981;&#29992;&#35828;&#65292;&#23545;&#21494;&#21326;&#26263;&#26263;&#20542;&#24515;&#30340;&#32477;&#19981;&#22312;&#23569;&#25968;&#12290;&#25110;&#26126;&#35328;&#12289;&#25110;&#26263;&#31034;&#12289;&#25110;&#22374;&#30333;&#12289;&#25110;&#38544;&#21947;&#22320;&#21521;&#22905;&#34920;&#36798;
&#29233;&#24847;&#30340;&#23601;&#26377;&#20116;&#20845;&#19971;&#20010;&#65292;&#32780;&#37027;&#20123;&#40664;&#40664;&#22857;&#29486;&#33258;&#24049;&#29233;&#24515;&#30340;&#26080;&#31169;&#32773;&#26356;&#26159;&#19981;&#21487;&#32988;&#35328;&#12290;&#20687;&#38463;&#35840;&#20043;&#35328;&#65292;&#36829;&#24515;
&#20043;&#35821;&#21487;&#20197;&#35753;&#20154;&#20135;&#29983;&#34394;&#39128;&#39128;&#22914;&#39550;&#20113;&#31471;&#30340;&#24863;&#35273;&#19968;&#26679;&#65292;&#36825;&#20123;&#19981;&#21487;&#26126;&#35328;&#30340;&#29233;&#24773;&#26263;&#31034;&#21516;&#26679;&#35753;&#20154;&#25214;&#19981;&#30528;&#21271;&#12290;
&#25105;&#20204;&#30475;&#21040;&#20054;&#24039;&#30340;&#29483;&#21674;&#32469;&#30528;&#22280;&#20799;&#36861;&#36880;&#33258;&#24049;&#30340;&#23614;&#24052;&#65292;&#25110;&#32773;&#31528;&#25305;&#30340;&#29399;&#20799;&#20026;&#20102;&#20027;&#20154;&#25163;&#20013;&#30340;&#19968;&#28857;&#39277;&#39135;&#65292;
&#32780;&#32728;&#36215;&#21069;&#33151;&#65292;&#36861;&#30528;&#39277;&#39135;&#32469;&#30528;&#20027;&#20154;&#36523;&#23376;&#36716;&#65292;&#24515;&#20013;&#20415;&#27833;&#28982;&#21319;&#36215;&#19968;&#32929;&#36523;&#20026;&#28789;&#38271;&#31867;&#21160;&#29289;&#30340;&#21464;&#24577;&#24555;&#24847;&#12290;
&#20551;&#22914;&#20320;&#26377;&#36807;&#36825;&#31181;&#20307;&#20250;&#65292;&#25110;&#35768;&#33021;&#20102;&#35299;&#21494;&#21326;&#24515;&#24773;&#20043;&#19975;&#19968;&#12290;

   &#32834;&#26494;&#20415;&#26159;&#36825;&#20247;&#22810;&#36861;&#27714;&#32773;&#20013;&#19981;&#21487;&#22810;&#24471;&#30340;&#19968;&#20301;&#65292;&#20182;&#30340;&#22823;&#32966;&#12289;&#20182;&#30340;&#30127;&#29378;&#12289;&#20182;&#30340;&#33258;&#20197;&#20026;&#26159;&#65292;&#32473;&#26102;&#21326;
&#30041;&#19979;&#20102;&#28145;&#21051;&#30340;&#21360;&#35937;&#12290;&#32834;&#26494;&#65292;&#20013;&#31561;&#36523;&#26448;&#65292;&#36523;&#20307;&#32467;&#23454;&#65292;&#39640;&#26114;&#30340;&#22836;&#39045;&#26174;&#31034;&#30528;&#20182;&#30340;&#33258;&#20449;&#65292;&#23439;&#20142;&#30340;&#22768;&#38899;
&#24432;&#26174;&#30528;&#20182;&#23545;&#26410;&#26469;&#30340;&#19968;&#29255;&#30475;&#22909;&#12290;&#32834;&#26494;&#65292;&#20174;&#23567;&#21463;&#30528;&#36149;&#26063;&#33324;&#30340;&#25945;&#32946;&#65292;&#22240;&#20026;&#20182;&#29238;&#20146;&#20105;&#27668;&#65292;&#23094;&#20102;&#19968;&#20010;&#23567;
&#23500;&#35946;&#30340;&#22899;&#20799;&#65292;&#29238;&#20146;&#32834;&#33635;&#31062;&#19982;&#27597;&#20146;&#32834;&#20113;&#33778;&#30340;&#32467;&#21512;&#20415;&#27880;&#23450;&#20102;&#20182;&#21069;&#36884;&#30340;&#26080;&#38480;&#37327;&#12290;&#32834;&#26494;&#30340;&#8220;&#32834;&#8221;&#23383;&#20223;
&#20315;&#20462;&#36766;&#23398;&#37324;&#30340;&#21452;&#20851;&#65292;&#21746;&#23398;&#37324;&#30340;&#19968;&#20998;&#20026;&#20108;&#65292;&#29983;&#29289;&#23398;&#37324;&#30340;&#20004;&#26646;&#31867;&#65292;&#20860;&#39038;&#20102;&#29238;&#20146;&#32834;&#33635;&#31062;&#12289;&#27597;&#20146;&#32834;&#20113;
&#33778;&#20004;&#20154;&#30340;&#22995;&#27663;&#65292;&#22909;&#22312;&#20182;&#29983;&#27963;&#22312;&#20108;&#21313;&#19968;&#19990;&#32426;&#65292;&#32493;&#23478;&#35889;&#30340;&#21476;&#35757;&#26089;&#24050;&#19981;&#22797;&#23384;&#22312;&#65292;&#25152;&#20197;&#23545;&#20110;&#32834;&#26494;&#23478;&#26063;
&#30340;&#21270;&#20998;&#20063;&#19981;&#35265;&#24471;&#37027;&#20040;&#37325;&#35201;&#65292;&#22806;&#20154;&#26356;&#27809;&#24517;&#35201;&#20102;&#35299;&#36825;&#20123;&#31169;&#23494;&#65292;&#19981;&#22952;&#31548;&#32479;&#22320;&#31216;&#21628;&#20182;&#20026;&#8220;&#32834;&#26494;&#8221;&#12290;&#32834;
&#26494;&#35265;&#35782;&#24191;&#65292;&#22240;&#20026;&#20182;&#27597;&#20146;&#35265;&#36807;&#30340;&#20154;&#36941;&#24067;&#22823;&#27743;&#21335;&#21271;&#65292;&#20182;&#35265;&#35782;&#8220;&#39640;&#8221;&#65292;&#25152;&#20197;&#35828;&#35805;&#24213;&#27668;&#36275;&#12289;&#22768;&#38899;&#22823;&#65292;
&#33600;&#23376;&#19981;&#26159;&#35828;&#20102;&#21527;&#8220;&#30331;&#39640;&#32780;&#21628;&#65292;&#22768;&#38750;&#21152;&#30142;&#20063;&#65292;&#32780;&#38395;&#32773;&#24432;&#8221;&#65292;&#32834;&#26494;&#19981;&#24517;&#8221;&#30331;&#39640;&#8220;&#32780;&#33021;&#22768;&#8220;&#21152;&#30142;&#8221;&#65292;
&#21453;&#26174;&#24471;&#33600;&#23376;&#35265;&#35782;&#29255;&#38754;&#12290;&#32834;&#26494;&#20010;&#23376;&#19981;&#31639;&#39640;&#65292;&#20294;&#20182;&#30475;&#24471;&#36828;&#65292;&#22240;&#20026;&#20182;&#30524;&#30555;&#38271;&#22312;&#22836;&#39030;&#19978;&#65292;&#22312;&#20182;&#30524;&#37324;&#65292;
&#20284;&#20046;&#27809;&#20182;&#21150;&#19981;&#25104;&#30340;&#20107;&#65292;&#25152;&#20197;&#65292;&#8220;&#25954;&#23383;&#24403;&#22836;&#8221;&#26159;&#20182;&#30340;&#22235;&#23383;&#31668;&#35328;&#12290;&#30001;&#20110;&#20182;&#30340;&#8220;&#25954;&#23383;&#24403;&#22836;&#8221;&#65292;&#20182;&#20063;
&#36827;&#20102;&#23398;&#29983;&#20250;&#12290;&#35828;&#36215;&#36825;&#27573;&#32463;&#21382;&#21487;&#20197;&#29992;&#8220;&#26354;&#25240;&#8221;&#26469;&#24418;&#23481;&#65292;&#22240;&#20026;&#20182;&#20026;&#27492;&#21442;&#21152;&#30340;&#38754;&#35797;&#19981;&#19979;&#25968;&#21313;&#27425;&#12290;&#20182;
&#26366;&#22312;&#23459;&#20256;&#37096;&#12289;&#25991;&#33402;&#37096;&#12289;&#20307;&#32946;&#37096;&#12289;&#22899;&#29983;&#37096;&#12289;&#35843;&#30740;&#37096;&#12289;&#32534;&#36753;&#37096;&#25253;&#36807;&#21517;&#12290;&#22312;&#23459;&#20256;&#37096;&#65292;&#20182;&#35828;&#20182;&#24605;&#32500;&#32540;
&#23494;&#65292;&#32452;&#32455;&#33021;&#21147;&#24378;&#65307;&#22312;&#23398;&#20064;&#37096;&#65292;&#20182;&#35828;&#20182;&#26041;&#27861;&#24471;&#24403;&#65292;&#23398;&#20064;&#33021;&#21147;&#24378;&#65307;&#22312;&#25991;&#33402;&#37096;&#65292;&#20182;&#35828;&#20182;&#28909;&#29233;&#33402;&#26415;&#65292;
&#34920;&#28436;&#33021;&#21147;&#24378;&#65307;&#22312;&#20307;&#32946;&#37096;&#65292;&#20182;&#35828;&#20182;&#36523;&#20307;&#24378;&#22766;&#65292;&#36816;&#21160;&#33021;&#21147;&#24378;&#12290;&#24635;&#20043;&#65292;&#25152;&#26377;&#33021;&#21147;&#20182;&#19968;&#24212;&#20465;&#20840;&#65292;&#20223;&#20315;
&#39277;&#24215;&#37324;&#30340;&#22823;&#21416;&#65292;&#20320;&#28857;&#20160;&#20040;&#20182;&#32473;&#20320;&#19978;&#20160;&#20040; &#65292;&#37240;&#29980;&#36763;&#36771;&#65292;&#20840;&#20973;&#20320;&#21475;&#21619;&#65307;&#21448;&#20687;&#21019;&#19990;&#32426;&#26102;&#26399;&#30340;&#20840;&#33021;&#19978;
&#24093;&#65292;&#23545;&#20122;&#24403;&#22799;&#23043;&#30340;&#35201;&#27714;&#65292;&#20840;&#19981;&#25918;&#22312;&#30524;&#37324;&#12290;&#22240;&#20102;&#20182;&#30340;&#33258;&#20449;&#65292;&#36825;&#20107;&#31455;&#28982;&#25104;&#20102;---&#32834;&#26494;&#25104;&#20102;&#20307;&#32946;&#37096;&#36135;
&#30495;&#20215;&#23454;&#12289;&#22914;&#20551;&#21253;&#25442;&#30340;&#19968;&#21592;&#12290;

    &#20572;&#36208;&#30340;&#38047;&#34920;&#65292;&#19968;&#22825;&#36824;&#26377;&#20004;&#20010;&#26102;&#21051;&#21487;&#20197;&#39556;&#20658;&#22320;&#23459;&#31216;&#33258;&#24049;&#23384;&#22312;&#30340;&#20215;&#20540;&#65292;&#26356;&#20309;&#20917;&#19968;&#20010;&#27963;&#29983;&#29983;&#30340;
&#20154;&#21602;&#65311;&#32834;&#26494;&#34429;&#28982;&#20658;&#24930;&#65292;&#21364;&#24182;&#38750;&#19968;&#26080;&#25152;&#38271;&#12290;&#20363;&#22914;&#20182;&#31726;&#29699;&#25171;&#24471;&#22909;&#65292;&#25110;&#35768;&#36825;&#20063;&#26159;&#20182;&#20026;&#20160;&#20040;&#20250;&#34987;&#20307;&#32946;
&#37096;&#25187;&#20303;&#30340;&#21407;&#22240;&#65292;&#25105;&#20204;&#19981;&#31105;&#35201;&#24863;&#24936;&#65306;&#29289;&#36136;&#30340;&#36523;&#20307;&#25165;&#26159;&#26368;&#22823;&#30340;&#26412;&#38065;&#65292; &#20854;&#23427;&#30340;&#19968;&#20999;&#37117;&#26159;&#34394;&#22916;&#12290;
&#8220;&#23398;&#20064;&#8221;&#8220;&#33021;&#21147;&#8221;&#8220;&#33402;&#26415;&#8221;&#22312;&#23427;&#38754;&#21069;&#31616;&#30452;&#21487;&#20197;&#24573;&#30053;&#19981;&#35745;&#65292;&#21542;&#21017;&#65292;&#32834;&#26494;&#20309;&#20197;&#20837;&#20303;&#20307;&#32946;&#37096;&#65292;&#32780;&#38750;&#65292;
&#23398;&#20064;&#37096;&#12289;&#25991;&#33402;&#37096;&#21602;&#65311;&#38590;&#36947;&#20182;&#8220;&#23398;&#20064;&#8221;&#19981;&#22909;&#65292;&#8220;&#33021;&#21147;&#8221;&#19981;&#24378;&#65292;&#8220;&#33402;&#26415;&#8221;&#32454;&#32990;&#36807;&#23569;&#65311;&#24456;&#26126;&#26174;&#65292;&#24182;
&#38750;&#22914;&#27492;&#12290;&#23398;&#38498;&#20030;&#34892;&#30340;&#31726;&#29699;&#27604;&#36187;&#20013;&#65292;&#20182;&#20204;&#29677;&#33021;&#19968;&#20030;&#30331;&#19978;&#20896;&#20891;&#30340;&#23453;&#24231;&#65292;&#20182;&#21487;&#35859;&#21151;&#19981;&#21487;&#27809;&#65307;&#31726;&#29699;&#20986;
&#25163;&#26102;&#20248;&#32654;&#30340;&#23039;&#21183;&#26356;&#26159;&#36186;&#26469;&#22330;&#36793;&#19981;&#23569;&#22899;&#29983;&#30340;&#23574;&#21483;&#22768;&#65292;&#20182;&#29233;&#36816;&#21160;&#65292;&#25152;&#20197;&#24615;&#26684;&#24320;&#26391;&#65292;&#20132;&#38469;&#38754;&#19981;&#21487;&#35859;
&#19981;&#24191;&#65292;&#25152;&#20197;&#65292;&#20182;&#33021;&#35328;&#21892;&#36777;&#65292;&#36777;&#35770;&#36187;&#12289;&#28436;&#35762;&#36187;&#20013;&#20063;&#26377;&#20182;&#30340;&#36523;&#24433;&#20986;&#27809;&#12290;&#22312;&#23398;&#38498;&#20013;&#20063;&#31639;&#19968;&#20010;&#23567;&#26377;&#21517;
&#27668;&#30340;&#20154;&#12290;&#20877;&#21152;&#19978;&#20182;&#19981;&#31639;&#24179;&#20961;&#30340;&#22806;&#34920;&#65292;&#31455;&#20063;&#24341;&#26469;&#19981;&#23569;&#20449;&#22899;&#20204;&#21521;&#20182;&#26263;&#35785;&#34935;&#24515;----&#20154;&#36825;&#21160;&#29289;&#29983;&#26469;&#23601;
&#19981;&#23433;&#20998;&#65292;&#25442;&#21477;&#19981;&#23458;&#27668;&#30340;&#35805;&#35828;&#65292;&#20154;&#36825;&#30044;&#29983;&#20559;&#22909;&#29359;&#36145;&#65292;&#22240;&#20026;&#23481;&#26131;&#21040;&#25163;&#30340;&#20182;&#19981;&#25026;&#24471;&#22914;&#20309;&#21435;&#29645;&#24796;&#65292;&#32780;
&#23545;&#37027;&#20123;&#26410;&#26366;&#25317;&#26377;&#36807;&#30340;&#21364;&#20559;&#22909;&#29978;&#28145;&#12290;&#24403;&#28982;&#65292;&#20174;&#36827;&#21270;&#23398;&#19978;&#32771;&#34385;&#65292;&#23545;&#20154;&#31867;&#26159;&#26377;&#21033;&#30340;&#65292;&#23427;&#35777;&#26126;&#20102;&#20154;&#31867;
&#36861;&#27714;&#30340;&#27704;&#26080;&#27490;&#22659;---&#36825;&#20123;&#22899;&#29983;&#31455;&#20840;&#19981;&#20837;&#20182;&#27861;&#30524;&#12290;&#19982;&#22905;&#20204;&#20132;&#24448;&#65292;&#20182;&#20250;&#23567;&#24515;&#22320;&#20445;&#25345;&#36317;&#31163;&#65292;&#20919;&#38745;&#22320;&#20998;
&#26512;&#29615;&#22659;&#65292;&#24039;&#22937; &#22320;&#25226;&#25569;&#26102;&#26426;&#65307;&#32477;&#19981;&#35828;&#36807;&#20998;&#30340;&#35805;&#65292; &#26356;&#19981;&#32473;&#22905;&#20204;&#26426;&#20250;&#35828;&#12290;&#22240;&#20026;&#8230;&#8230;

    &#21494;&#21326;&#24050;&#35760;&#19981;&#28165;&#37027;&#22825;&#26159;&#20960;&#21495;&#20102;&#65292;&#22905;&#21482;&#35760;&#24471;&#8220;&#36814;&#26032;&#26202;&#20250;&#8221;&#19978;&#65292;&#28436;&#23436;&#33310;&#36424;&#12298;&#30334;&#28789;&#20043;&#27468;&#12299;&#35874;&#24149;&#26102;&#65292;
&#31361;&#28982;&#36305;&#19978;&#26469;&#19968;&#20301;&#25163;&#25447;&#40092;&#33457;&#30340;&#30007;&#29983;&#65292;&#35201;&#32473;&#22905;&#29486;&#33457;&#65292;&#12290;&#29486;&#33457;&#36825;&#31181;&#20107;&#22905;&#20197;&#21069;&#19981;&#26159;&#27809;&#32463;&#21382;&#36807;&#12290;&#27599;&#27425;&#65292;
&#20026;&#29238;&#20146;&#22312;&#22312;&#23458;&#20154;&#38754;&#21069;&#34920;&#28436;&#65292;&#29238;&#20146;&#37117;&#20250;&#32473;&#22905;&#29486;&#33457;&#65292;&#24403;&#28982;,&#19981;&#21482;&#26159;&#33457;,&#31607;&#23376;&#12289;&#37202;&#29942;&#34987;&#24403;&#20316;&#40092;&#33457;&#29486;&#32473;
&#22905;&#20063;&#26159;&#26377;&#30340;&#12290;&#20013;&#23398;&#26102;&#26399;&#30340;&#30007;&#22899;&#20851;&#31995;&#65292;&#25630;&#24471;&#26159;&#22320;&#19979;&#27963;&#21160;&#65292;&#29486;&#33457;&#36825;&#31181;&#24352;&#25196;&#30340;&#34892;&#20026;&#20687;&#39540;&#39532;&#30340;&#26434;&#31181;&#33021;
&#22815;&#20135;&#23869;&#19968;&#26679;&#26159;&#32477;&#23545;&#19981;&#20250;&#21457;&#29983;&#30340;&#12290;&#25152;&#20197;&#65292;&#29238;&#20146;&#20197;&#22806;&#30340;&#24322;&#24615;&#32473;&#22905;&#29486;&#33457;&#21364;&#26159;&#26377;&#21490;&#20197;&#26469;&#30340;&#31532;&#19968;&#27425;&#12290;&#36825;
&#24050;&#32463;&#22815;&#35753;&#22905;&#31384;&#30340;&#20102;&#65292;&#37027;&#30007;&#29983;&#31455;&#22312;&#29486;&#33457;&#26102;&#65292;&#22312;&#22905;&#38754;&#21069;&#23567;&#22768;&#35828;&#20986;&#8220;&#20320;&#30495;&#28418;&#20142; &#65292;&#25105;&#21916;&#27426;&#20320;&#12290;&#8221;&#30340;&#35805;&#65292;
&#28982;&#21518;&#24847;&#21619;&#28145;&#38271;&#22320;&#36319;&#22905;&#30473;&#30446;&#20256;&#24773;&#65292;&#36305;&#20102;&#19979;&#21435;&#12290;&#24403;&#28982;&#36825;&#22768;&#38899;&#21482;&#22905;&#19968;&#20010;&#21548;&#24471;&#21040;&#65292;&#20294;&#26159;&#65292;&#20687;&#25170;&#25163;&#34892;&#31373;
&#29616;&#22330;&#34987;&#25417;&#65292;&#32771;&#22330;&#20316;&#24330;&#24403;&#22330;&#25810;&#33719;&#19968;&#26679;&#65292;&#22905;&#33080;&#19978;&#31455;&#30636;&#38388;&#32472;&#20986;&#20004;&#22359;&#26377;&#35268;&#21017;&#30340;&#32418;&#26197;&#65292;&#20986;&#20135;&#20316;&#21697;&#30340;&#36895;&#24230;
&#35753;&#32472;&#30011;&#22823;&#24072;&#36798;&#33452;&#22855;&#33258;&#21497;&#19981;&#22914;&#12290;&#21494;&#21326;&#24198;&#24184;&#34920;&#28436;&#20043;&#21069;&#19978;&#36807;&#22918;&#65292;&#33310;&#21488;&#30340;&#28783;&#20809;&#20063;&#36824;&#26263;&#24471;&#21487;&#20197;&#65292;&#33258;&#24049;&#30340;
&#31959;&#24577;&#25165;&#24471;&#20197;&#25513;&#39280;&#12290;&#22905;&#24613;&#20110;&#36867;&#31163;&#33310;&#21488;&#65292;&#33050;&#19979;&#36208;&#24471;&#24613;&#20102;&#65292;&#38505;&#20123;&#25684;&#20498;&#65292;&#24184;&#26377;&#21516;&#20276;&#22312;&#36523;&#36793;&#24110;&#25206;&#20102;&#19968;&#25226;&#65292;
&#25165;&#20813;&#27492;&#19968;&#21163;&#12290;&#19979;&#24471;&#21488;&#26469;&#65292;&#24179;&#25242;&#20102;&#19968;&#19979;&#24773;&#32490;&#65292;&#28040;&#23613;&#20102;&#33080;&#19978;&#30340;&#32418;&#26197;&#65292;&#25165;&#26377;&#24515;&#24605;&#36861;&#26597;&#26696;&#20214;&#30340;&#20803;&#20982;&#12290;
&#22905;&#24515;&#37324;&#26263;&#39554;&#23548;&#28436;&#30095;&#24573;&#65292;&#27809;&#23613;&#20445;&#25252;&#28436;&#21592;&#30340;&#32844;&#36131;&#65307;&#26356;&#24680;&#29486;&#33457;&#20043;&#20154;&#21776;&#31361;&#12290;&#22238;&#24518;&#36215;&#26469;&#65292;&#37027;&#24352;&#38754;&#23380;&#21407;&#26159;
&#35265;&#36807;&#30340;&#65292;&#21482;&#26159;&#33310;&#21488;&#19978;&#21254;&#24537;&#19968;&#30629;&#65292;&#20687;&#36879;&#36807;&#33945;&#20102;&#27700;&#27773;&#30340;&#38236;&#38754;&#65292;&#30475;&#24471;&#24182;&#19981;&#30495;&#20999;&#65292;&#21482;&#30693;&#20182;&#21516;&#26159;&#23398;&#29983;&#20250;
&#30340;&#65292;&#21517;&#23383;&#37324;&#22823;&#27010;&#24102;&#20010;&#8220;&#26494;&#8221;&#23383;&#25110;&#8220;&#39118;&#8221;&#23383;&#65292;&#22909;&#20687;&#19982;&#22905;&#26159;&#21516;&#23447;&#21516;&#26063;&#65292;&#20854;&#20182;&#23601;&#19968;&#27010;&#19981;&#30693;&#20102;&#12290;&#30452;&#21040;
&#24403;&#26202;&#23601;&#23517;&#26102;&#65292;&#21494;&#21326;&#25165;&#24324;&#28165;&#20182;&#30340;&#21517;&#22995;&#65292;&#22240;&#20026;&#32834;&#26494;&#32473;&#22905;&#21457;&#30701;&#20449;&#20316;&#33258;&#25105;&#20171;&#32461;&#65292;&#24182;&#21521;&#22905;&#26126;&#20102;&#24515;&#36857;&#65292;&#35828;
&#35201;&#36861;&#22905;&#20570;&#22899;&#26379;&#21451;&#12290;&#30452;&#21040;&#27492;&#26102;&#65292;&#21494;&#21326;&#25165;&#30693;&#20182;&#26159;&#22995;&#8220;&#32834;&#8221;&#32780;&#38750;&#19982;&#22905;&#21516;&#23447;&#65292;&#22995;&#8220;&#21494;&#8221;&#12290;&#19981;&#20037;&#21518;&#30340;&#20960;
&#22825;&#65292;&#22905;&#30340;&#25163;&#26426;&#20415;&#21463;&#21040;&#20102;&#32834;&#26494;&#30340;&#30127;&#29378;&#30701;&#20449;&#36720;&#28856;&#12290;

  &#21494;&#21326;&#30340;&#24515;&#22909;&#20687;&#26159;&#20998;&#23618;&#30340;&#65292;&#36739;&#27973;&#30340;&#19968;&#23618;&#35828;&#22905;&#23545;&#32834;&#26494;&#30340;&#34892;&#20026;&#19981;&#32988;&#20854;&#28902;&#65292;&#24680;&#19981;&#24471;&#23558;&#20182;&#30862;&#23608;&#19975;&#27573;&#12290;
&#32780;&#36739;&#28145;&#19968;&#23618;&#30340;&#21364;&#24863;&#21040;&#19968;&#19997;&#30340;&#29980;&#34588;&#12290;&#36825;&#31181;&#24863;&#35273;&#20223;&#20315;&#21476;&#26102;&#30007;&#22899;&#25171;&#24773;&#39554;&#20431;&#26102;&#24120;&#35828;&#30340;&#35789;&#8220;&#20900;&#23478;&#8221;&#65292;&#34920;
&#38754;&#26159;&#35828;&#20004;&#32773;&#21183;&#22914;&#27700;&#28779;&#65292;&#28145;&#23618;&#21364;&#20256;&#36798;&#20102;&#24444;&#27492;&#35828;&#19981;&#20986;&#30340;&#20381;&#24651;&#12290; &#21494;&#21326;&#20869;&#24515;&#40664;&#35768;&#20102;&#32834;&#26494;&#30340;&#34892;&#20026;&#65292; &#24403;
&#28982;&#22905;&#33258;&#24049;&#24182;&#19981;&#25215;&#35748;&#65292; &#20294;&#36825;&#31181;&#19981;&#25215;&#35748;&#21482;&#20687;&#25104;&#35821;&#8220;&#27442;&#25512;&#36824;&#23601;&#8221;&#30340;&#8220;&#25512;&#8221;&#23383;&#65292;&#38500;&#20102;&#36974;&#32670;&#65292;&#19997;&#27627;&#27809;&#26377;
&#23454;&#38469;&#24847;&#20041;&#12290;&#20294;&#21494;&#21326;&#24182;&#19981;&#21916;&#27426;&#32834;&#26494;&#65292;&#36825;&#26159;&#22905;&#24895;&#24847;&#25215;&#35748;&#30340;&#65292;&#22240;&#20026;&#38754;&#23545;&#32834;&#26494;&#22905;&#24182;&#27809;&#26377;&#24515;&#36339;&#21152;&#36895;&#30340;&#24863;
&#35273; &#65292;&#22905;&#21482;&#24863;&#21040;&#21050;&#28608;&#65292;&#20687;&#23567;&#26102;&#20505;&#20570;&#20102;&#22351;&#20107;&#65292;&#25104;&#21151;&#36867;&#33073;&#21518;&#30340;&#24863;&#35273;&#12290;&#21478;&#22806;&#65292;&#34987;&#30007;&#29983;&#21916;&#27426; &#65292;&#22905;&#20250;&#26377;
&#19968;&#31181;&#24449;&#26381;&#24863;&#65292;&#27599;&#22825;&#26377;&#30007;&#29983;&#22312;&#22905;&#36523;&#36793;&#32469;&#30528;&#22905;&#36716;&#65292;&#21487;&#20197;&#28385;&#36275;&#22905;&#23567;&#23567;&#30340;&#34394;&#33635;&#24515;&#65307;&#22312;&#20854;&#20182;&#22899;&#29983;&#38754;&#21069;&#65292;
&#22905;&#21487;&#20197;&#23558;&#22836;&#26114;&#24471;&#39640;&#39640;&#30340;&#65292;&#34429;&#28982;&#22905;&#26114;&#24471;&#24050;&#32463;&#22815;&#39640;&#20102;&#12290;&#22905;&#29702;&#35299;&#20026;&#20160;&#20040;&#34915;&#39135;&#26080;&#24551;&#30340;&#27494;&#21017;&#22825;&#12289;&#24904;&#31143;&#20026;
&#20160;&#20040;&#28909;&#34935;&#20110;&#26435;&#21147;&#12290;&#22905;&#24819;&#65292;&#22914;&#26524;&#25442;&#20316;&#26159;&#22905;&#65292;&#22905;&#20063;&#20250;&#25928;&#20223;&#22905;&#20204;&#30340;&#12290;

   &#38543;&#21518;&#30340;&#20960;&#22825;&#65292;&#30001;&#20110;&#23398;&#29983;&#20250;&#20869;&#37096;&#20154;&#21592;&#24037;&#20316;&#30340;&#38656;&#35201;&#65292;&#21494;&#21326;&#12289;&#32834;&#26494;&#30340;&#20851;&#31995;&#36880;&#28176;&#21464;&#24471;&#19981;&#20877;&#37027;&#20040;&#38476;&#29983;&#12290;
&#32834;&#26494;&#26377;&#20102;&#26356;&#22810;&#30340;&#26426;&#20250;&#25509;&#36817;&#20182;&#24515;&#20013;&#30340;&#22899;&#31070;&#12290;&#21494;&#21326;&#20919;&#28129;&#22320;&#25509;&#21463;&#32834;&#26494;&#30340;&#21508;&#31181;&#36992;&#35831;&#65292;&#24403;&#28982;&#65292;&#26368;&#21021;&#30340;&#25512;
&#36766;&#26159;&#24517;&#19981;&#21487;&#23569;&#30340;&#65292;&#31572;&#24212;&#36992;&#35831;&#26102;&#26174;&#24471;&#36234;&#26159;&#21193;&#24378;&#65292;&#36234;&#33021;&#35753;&#23545;&#26041;&#35273;&#24471;&#22905;&#19981;&#26159;&#38543;&#20415;&#35841;&#37117;&#33021;&#35831;&#24471;&#21160;&#30340;&#12290;
&#26377;&#26102;&#65292;&#22905;&#20063;&#20250;&#25298;&#32477;&#65292;&#20294;&#27492;&#26102;&#30340;&#25298;&#32477;&#24688;&#20687;&#29422;&#23376;&#25615;&#20820;&#26102;&#30340;&#36523;&#23376;&#21518;&#23624;&#65292;&#21448;&#20687;&#36339;&#36828;&#36816;&#21160;&#21592;&#20026;&#21161;&#36305;&#32780;&#21518;
&#36864;&#30340;&#20960;&#27493;&#12290;&#25298;&#32477;&#21453;&#22686;&#22810;&#20102;&#21463;&#36992;&#30340;&#27425;&#25968;&#65292;&#36825;&#26159;&#21494;&#21326;&#22987;&#26009;&#26410;&#21450;&#30340;&#12290;&#20110;&#26159;&#21494;&#21326;&#26377;&#20102;&#26356;&#22810;&#30340;&#20813;&#36153;&#21320;&#39184;
&#21487;&#21507;&#65292;&#20813;&#36153;&#30005;&#24433;&#21487;&#30475;&#12290;&#22937;&#30340;&#26159;&#65292;&#32834;&#26494;&#22806;&#31062;&#29238;&#30340;&#38065;&#24635;&#33457;&#19981;&#23436;&#65292;&#21494;&#21326;&#30340;&#32963;&#20063;&#36824;&#35013;&#24471;&#19979;&#65292;&#36825;&#26679;&#30340;&#24773;
&#22659;&#24635;&#25345;&#32493;&#24471;&#19979;&#21435;&#12290;&#30007;&#29983;&#38656;&#35201;&#21220;&#24037;&#21161;&#23398;&#25165;&#33021;&#30053;&#20026;&#20943;&#36731;&#23478;&#37324;&#30340;&#36127;&#25285;&#65292;&#32780;&#22899;&#29983;&#21482;&#38656;&#38271;&#24471;&#28418;&#20142;&#65292;&#20415;&#36275;
&#22815;&#20102;&#12290;&#36825;&#26159;&#21494;&#21326;&#21448;&#19968;&#27425;&#24778;&#22855;&#30340;&#21457;&#29616;&#65292;&#36825;&#27425;&#21457;&#29616;&#30340;&#20215;&#20540;&#19981;&#27604;&#21733;&#21270;&#24067;&#21457;&#29616;&#26032;&#22823;&#38470;&#23567;&#65292;&#22240;&#20026;&#8230;&#8230;

    &#21494;&#21326;&#26159;&#20010;&#22899;&#22823;&#23398;&#29983;&#65292;&#20551;&#20351;&#20320;&#23398;&#36807;&#36923;&#36753;&#23398;&#65292;&#20320;&#20250;&#21457;&#29616;&#65292;&#8220;&#22899;&#22823;&#23398;&#29983;&#8221;&#19982;&#8220;&#20154;&#8221;&#20004;&#27010;&#24565;&#30340;&#22806;
&#24310;&#26159;&#8220;&#31181;&#23646;&#20851;&#31995;&#8221;&#65292;&#21363;&#8220;&#30495;&#21253;&#21547;&#20851;&#31995;&#8221;&#12290;&#25105;&#20204;&#21448;&#24819;&#21040;&#26575;&#25289;&#22270;&#20026;&#20154;&#31867;&#19979;&#30340;&#23450;&#20041;&#65306;&#20154;&#32773;&#65292;&#26080;&#32701;&#20043;
&#20004;&#36275;&#21160;&#29289;&#20063;&#65281;&#22312;&#21338;&#39532;&#33293;&#12298;&#36259;&#23035;&#32536;&#12299;&#37324;&#20063;&#26366;&#24341;&#36807;&#19982;&#20043;&#26377;&#24322;&#26354;&#21516;&#24037;&#20043;&#22937;&#30340;&#19968;&#21477;&#65306;&#20154;&#26159;&#19981;&#28212;&#32780;&#39278;&#65292;
&#22235;&#23395;&#26377;&#24615;&#27442;&#30340;&#21160;&#29289;&#12290;&#30001;&#27492;&#25105;&#20204;&#19981;&#38590;&#25512;&#20986;&#26576;&#20123;&#32467;&#35770;&#12290;&#35802;&#28982;&#65292;&#21494;&#21326;&#40664;&#35748;&#19982;&#32834;&#26494;&#20132;&#24448;&#65292;&#38500;&#20102;&#8220;&#21220;&#24037;
&#21161;&#23398;&#8221;&#30340;&#21407;&#22240;&#22806;&#65292;&#21487;&#20197;&#35828;&#20063;&#26159;&#22240;&#20102;&#36825;&#20010;&#32467;&#35770;&#12290;&#22905;&#21916;&#27426;&#25163;&#34987;&#30007;&#29983;&#25569;&#30528;&#30340;&#24863;&#35273;&#65292;&#36825;&#35753;&#22905;&#24863;&#21463;&#21478;&#19968;
&#31181;&#23436;&#20840;&#19981;&#21516;&#30340;&#21050;&#28608;&#12290;&#24403;&#28982;&#65292;&#20986;&#20110;&#22899;&#24615;&#22825;&#29983;&#30340;&#32670;&#24623;&#24515;&#29702;&#65292;&#22905;&#24182;&#19981;&#23558;&#23427;&#34920;&#29616;&#22312;&#33080;&#19978;&#12290;&#26377;&#26102;&#26202;&#19978;&#30005;
&#24433;&#25955;&#22330;&#21518;&#65292;&#36208;&#21040;&#20731;&#38745;&#20043;&#25152;&#65292;&#21494;&#21326;&#20250;&#36973;&#21040;&#32834;&#26494;&#30340;&#19968;&#38453;&#25250;&#21563;&#12290;&#33258;&#28982;&#65292;&#36825;&#21563;&#35813;&#32467;&#26463;&#30340;&#26102;&#20505;&#65292;&#22905;&#20250;&#26524;
&#26029;&#22320;&#25379;&#33073;&#20182;&#30340;&#24576;&#25265;&#65307;&#29983;&#27668;&#22320;&#31163;&#24320;&#65307;&#30701;&#26242;&#22320;&#19981;&#29702;&#19981;&#30572;&#65307;&#20960;&#22825;&#25110;&#19968;&#22825;&#21518;&#65292;&#25509;&#21463;&#20182;&#30340;&#36947;&#27465;,&#32473;&#20182;&#35686;
&#21578;,&#28982;&#21518; &#65292;&#20877;&#27425;&#36208;&#36827;&#30005;&#24433;&#38498;&#12290;&#19981;&#21388;&#20854;&#28902;&#22320;&#37325;&#22797;&#36825;&#31181;&#31163;&#31163;&#21512;&#21512;&#65292;&#24182;&#20048;&#27492;&#19981;&#30130;&#12290;&#21494;&#21326;&#20415;&#36825;&#26679;&#20197;&#38750;
&#22899;&#21451;&#30340;&#36523;&#20221;&#21344;&#25454;&#30528;&#32834;&#26494;&#22899;&#21451;&#30340;&#20301;&#32622;&#65292;&#36798;&#20004;&#19977;&#20010;&#26376;&#20043;&#20037;&#12290;&#22905;&#24182;&#19981;&#21916;&#27426;&#32834;&#26494;&#65292;&#24403;&#28982;&#65292;&#26356;&#35848;&#19981;&#19978;&#29233;&#65292;
&#22905;&#21482;&#24076;&#26395;&#19982;&#32834;&#26494;&#20445;&#25345;&#19968;&#31181;&#32454;&#33147;&#12289;&#26406;&#32999;&#12289;&#38544;&#32422;&#12289;&#26279;&#26151;&#30340;&#24863;&#24773;&#20851;&#31995;&#65292;&#28857;&#32512;&#30528;&#30007;&#22899;&#26379;&#21451;&#38388;&#30340;&#21916;&#24594;&#21696;
&#20048;&#65292;&#25171;&#21457;&#30528;&#31354;&#34394;&#26080;&#32842;&#30340;&#22823;&#23398;&#29983;&#27963;&#12290;&#36825;&#31181;&#20851;&#31995;&#20284;&#20551;&#36824;&#30495;&#65292;&#33509;&#26377;&#33509;&#26080;&#65292;&#25769;&#20154;&#24515;&#24358;&#65292;&#24525;&#19981;&#20303;&#35753;&#22905;&#24515;
&#20026;&#20043;&#21160;&#12290;&#23545;&#20110;&#21494;&#21326;&#36825;&#31181;&#22899;&#20154;&#65292;&#36825;&#26159;&#26368;&#26377;&#36259;&#30340;&#28040;&#36963;&#65292;&#21516;&#26102;&#21448;&#26159;&#26368;&#23433;&#20840;&#30340;&#12290;&#22240;&#20026;&#65292;&#21487;&#20197;&#38450;&#27490;&#24444;&#27492;
&#26377;&#36807;&#28779;&#30340;&#20030;&#21160;&#65292;&#20316;&#20026;&#19968;&#20010;&#26580;&#24369;&#30340;&#22899;&#29983; &#65292;&#36825;&#26159;&#22905;&#19981;&#24471;&#19981;&#32771;&#34385;&#30340;&#38382;&#39064;&#12290;&#21494;&#21326;&#38518;&#37257;&#20110;&#36825;&#31181;&#20851;&#31995;&#65292;&#22905;
&#30340;&#34394;&#33635;&#24515;&#24471;&#21040;&#26368;&#22823;&#31243;&#24230;&#30340;&#28385;&#36275;&#12290;

    &#20294;&#32834;&#26494;&#21364;&#24182;&#19981;&#28385;&#36275;&#65292;&#20182;&#35201;&#21494;&#21326;&#20570;&#20182;&#30340;&#22899;&#21451;&#65292;&#36825;&#31181;&#20284;&#26159;&#32780;&#38750;&#30340;&#20851;&#31995;&#35753;&#20182;&#30340;&#33258;&#23562;&#24515;&#20005;&#37325;&#21463;&#20260;&#65292;
&#22810;&#27425;&#30340;&#21162;&#21147;&#65292;&#35753;&#20182;&#20135;&#29983;&#30333;&#36153;&#24515;&#24605;&#30340;&#22833;&#26395;&#12290;&#31354;&#20570;&#23613;&#24352;&#33268;&#65292;&#30475;&#20284;&#21608;&#21040;&#20307;&#36148;&#65292;&#21364;&#21482;&#20687;&#12298;&#26684;&#21015;&#20315;&#28216;&#35760;&#12299;
&#20013;&#33258;&#20197;&#20026;&#31934;&#32654;&#32477;&#20262;&#30340;&#34915;&#26381;&#65292;&#22312;&#37027;&#24110;&#23567;&#20154;&#30475;&#26469;&#65292;&#21482;&#19981;&#36807;&#19982;&#20182;&#20204;&#35013;&#26434;&#29289;&#30340;&#40635;&#34955;&#30456;&#20284;&#65292;&#32834;&#26494;&#30340;&#21608;&#21040;
&#20307;&#36148;&#65292;&#22312;&#21494;&#21326;&#30524;&#37324;&#65292;&#24656;&#24597;&#20063;&#21482;&#19981;&#36807;&#26159;&#36825;&#26679;&#30340;&#19968;&#21482;&#40635;&#34955;&#12290;&#20182;&#30340;&#20307;&#36148;&#65292;&#21035;&#20154;&#21387;&#26681;&#23601;&#19981;&#39046;&#24773;&#12290;&#36825;&#31181;
&#24651;&#29233;&#21448;&#20047;&#21619;&#65292;&#21448;&#25918;&#19981;&#19979;&#65292;&#24635;&#19981;&#33021;&#26080;&#32467;&#26524;&#23601;&#20102;&#32467;&#20102;&#12290;&#21153;&#24517;&#23547;&#20010;&#26426;&#20250;&#21457;&#36215;&#26368;&#21518;&#30340;&#24635;&#25915;&#12290;&#21738;&#24597;&#32467;&#23616;
&#26159;&#22833;&#36133;&#12290;&#32834;&#26494;&#20934;&#22791;&#25509;&#21463;&#22833;&#36133;&#65292;&#19982;&#22905;&#32477;&#20132;&#12289;&#25110;&#32773;&#26029;&#32477;&#36825;&#31181;&#30340;&#20851;&#31995;&#12290;&#30828;&#29983;&#29983;&#22320;&#25286;&#24320;&#20063;&#27604;&#19981;&#24178;&#19981;&#33030;&#65292;
&#19981;&#30171;&#19981;&#30162;&#22320;&#25302;&#19979;&#21435;&#30340;&#22909;&#12290;

    &#19968;&#20010;&#26143;&#26399;&#21518;&#65292;&#23398;&#29983;&#20250;&#32452;&#32455;&#37096;&#32452;&#32455;&#20102;&#19968;&#20010;&#28436;&#20986;&#27963;&#21160;&#21494;&#21326;&#29031;&#20363;&#21442;&#21152;&#20102;&#33310;&#36424;&#28436;&#20986;&#12290;&#32834;&#26494;&#25171;&#31639;&#28436;
&#20986;&#21518;&#32422;&#22905;&#20986;&#26469; &#65292;&#20316;&#26368;&#21518;&#30340;&#22374;&#30333;&#12290;&#32467;&#26524;&#19968;&#20999;&#22914;&#20182;&#25152;&#26009;&#65292;&#19968;&#20999;&#37117;&#32467;&#26463;&#20102;&#12290;&#25353;&#35828;&#65292;&#22833;&#24651;&#20102;&#20182;&#35813;&#29031;&#20363;
&#20260;&#24515;&#19968;&#38453;,&#20170;&#22812;&#30340;&#20182;&#31455;&#20986;&#22855;&#30340;&#26080;&#19968;&#19997;&#24754;&#20260;&#65292;&#20182;&#21482;&#24863;&#21040;&#36731;&#26494;&#65292;&#24515;&#20687;&#34987;&#20912;&#27700;&#27927;&#36807;&#19968;&#33324; &#65292;&#20986;&#22855;&#22320;&#36879;
&#26126;&#12289;&#20919;&#38745;&#12290;&#20998;&#25163;&#26102;&#65292;&#21494;&#21326;&#35828;&#24444;&#27492;&#36824;&#21487;&#20197;&#20570;&#26379;&#21451;&#65307;&#36824;&#35828;&#65292;&#26222;&#36890;&#26379;&#21451;&#20043;&#38388;&#30340;&#24863;&#24773;&#26410;&#24517;&#27604;&#30007;&#22899;&#26379;&#21451;
&#24046;&#12290;&#32834;&#26494;&#26080;&#21487;&#26080;&#19981;&#21487;&#22320;&#33510;&#31505;&#65292;&#21494;&#21326;&#19981;&#25954;&#38754;&#23545;&#36825;&#31505;&#65292;&#21482;&#22909;&#25214;&#20010;&#20511;&#21475;&#65292;&#35828;&#32047;&#20102;&#65292;&#38745;&#38745;&#22320;&#31163;&#24320;&#20102;&#12290;
&#32834;&#26494;&#38745;&#38745;&#22320;&#30446;&#36865;&#30528;&#21494;&#21326;&#30340;&#36523;&#24433;&#28040;&#34701;&#22312;&#26657;&#22253;&#30340;&#22812;&#33394;&#20013;&#65292; &#21574;&#21574;&#22320;&#31435;&#20102;&#19968;&#20250;&#20799;&#65292;&#38271;&#38271;&#22320;&#33298;&#20102;&#19968;&#21475;&#27668;&#65292;
&#36808;&#24320;&#20102;&#33050;&#27493;&#65292;&#21516;&#26679;&#34987;&#26080;&#36793;&#30340;&#22812;&#33394;&#21534;&#27809;&#20102;&#12290;
</pre>
  </body>
</html>
